{
    "app_title": "Yevhenii Airapetian - Portafolio",
    "languages": "lenguas",
    "welcome text": "Hola, soy Yevhenii",
    "resume": "Currículum",
    "introduction": "Soy un desarrollador web apasionado por la tecnología",
    "experience": "Tengo experiencia en la enseñanza de lenguas extranjeras y en redacción académica, y me entusiasma trabajar en desarrollo web.",
    "first focus": "Siempre me he centrado en ofrecer un trabajo de alta calidad que cumpliera los plazos, empleando mis refinadas habilidades de resolución de problemas, gestión del tiempo y pensamiento lógico.",
    "second focus": "Mi objetivo es combinar mi experiencia con mis aspiraciones profesionales para ayudar a crear soluciones de software funcionales, receptivas y accesibles.",
    "availability": "Estoy disponible para trabajo de oficina e híbrido en la zona de Berlín y Potsdam o a distancia.",
    "hobbies": "Además de mis pasiones en el desarrollo web, también soy un fotógrafo aficionado activo y un entusiasta del fitness, y en cualquier otro día puedes encontrarme fuera haciendo fotos o levantando pesas.",
    "code": "código",
    "projects": "Proyectos",
    "projectsInfo": "Aquí encontrarás los proyectos actuales de desarrollo web que he completado y en los que he trabajado. Todos ellos tienen hipervínculos a la base de código y los casos del proyecto, la mayoría tienen un enlace a la versión desplegada, y algunos también tienen enlaces adicionales.",
    "projectsViewTip": "Utilice los controles deslizantes para desplazarse por la lista de proyectos. Mueva el ratón sobre una diapositiva concreta para mostrar los enlaces del proyecto.",
    "r3playInfo": "La interfaz de la API web de R3play que permite a los usuarios registrarse y darse de baja, ver información sobre películas, series de televisión y anime, y gestionar su lista de favoritos.",
    "r3playAPIInfo": "API web desarrollada con Node.js, Express y MongoDB que permite a los usuarios registrarse, darse de baja, ver información sobre películas, programas de televisión y animes, y gestionar favoritos.",
    "myFlixInfo": "Una parte front-end para la API web de R3play diseñada con Angular, Typescript y Material UI que permite a los usuarios registrarse, ver información sobre películas y añadir favoritos.",
    "meetInfo": "Una Progressive Web App escrita con AWS Lambda Functions que utiliza autorización y autenticación OAuth2 y muestra eventos de la API de Google Calendar de CareerFoundry.",
    "owriteInfo": "Una aplicación React Native que permite a los usuarios chatear. Los usuarios pueden establecer un nombre de usuario, elegir el color de fondo del chat y enviar mensajes de texto, imágenes y grabaciones de audio.",
    "pokemonInfo": "Una app Pokemon responsive que recupera Pokemon con Ajax desde una API Pokedex externa y muestra su información como tamaño, peso, ID, imágenes frontales y traseras",
    "toDoInfo": "Una aplicación de tareas pendientes jQuery y Bootstrap que permite a los usuarios gestionar las tareas pendientes. Los usuarios pueden añadir, eliminar y reordenar tareas, crear y eliminar listas de tareas pendientes y ver instrucciones de uso de la app.",
    "projectsSliderMore": "más",
    "testimonials": "La gente dice",
    "wordOfMouth": "No estaría donde estoy hoy sin toda la gente maravillosa con la que he tenido el privilegio de trabajar",
    "testimonialsViewTip": "Utiliza los controles deslizantes para desplazarte por la lista de testimonios. Pasa el ratón por encima de los títulos de los testimonios para leer más.",
    "testimonial1": "Maya Septriana, Consultora de Carrera, CareerFoundry",
    "testimonial2": "Nizar Triki, Gerente de Ingeniería de Software chez Expensya",
    "testimonial3": "Dejan Gogov, Desarrollador Web, Wild Code School",
    "testimonial1Text": "Yevhenii es alguien con quien es muy fácil colaborar. Siempre se esfuerza por alcanzar la excelencia. Cada vez que le doy mi opinión, está dispuesto a escuchar y ajustar la presentación...",
    "testimonial2Text": "Tuve la oportunidad de ser mentor de Yevhenii a lo largo de su formación en desarrollo web en CareerFoundry. La autosuficiencia de Yevhenii, la rápida comprensión de los conceptos...",
    "testimonial3Text": "Durante nuestro bootcamp Fullstack de 6 meses, Yevhenii mostró constantemente un comportamiento positivo y amistoso. Abordaba las tareas con determinación...",
    "testimonialsMore": "más",
    "contact": "Contacto",
    "suggestion": "¿Quieres trabajar juntos o tienes una sugerencia? Estoy abierto a oportunidades de reclutamiento y comentarios",
    "eMailMe": "Siéntase libre de enviarme un correo electrónico utilizando el siguiente formulario",
    "contactFormHeader": "Contacto",
    "firstName": "Nombre",
    "firstNamePlaceholder": "Joey",
    "lastName": "Apellido",
    "lastNamePlaceholder": "Tribbiani",
    "phoneNumber": "Número de teléfono",
    "phoneNumberPlaceholder": "+49 1234 5678910",
    "eMail": "Correo electrónico",
    "eMailPlaceholder": "example@mail.com",
    "messageOrComment": "Mensaje o comentario. ¡Por favor, sé amable!",
    "messageOrCommentPlaceholder": "Tu mensaje",
    "contactFormTip": "Los campos marcados con un asterisco son obligatorios",
    "contactFormPoweredBy": "Desarrollado por",
    "caseTDD":"Desarrollo impulsado por pruebas",
    "caseServerAndApi":"Lado del servidor y API",
    "caseAgile":"Flujo de trabajo ágil",
    "caseOverview": "Visión general",
    "casePurpose": "Propósito y contexto",
    "caseObjective": "Objetivo",
    "caseServer": "Lado del servidor",
    "caseClient": "Lado del cliente",
    "caseApproach": "Enfoque",
    "caseDuration": "Duración",
    "caseRetrospective": "Retrospectiva",
    "caseChallenges": "Desafíos.",
    "caseConclusion": " Conclusión y conclusiones clave",
    "caseMainTakeaways": "Principales conclusiones para futuros proyectos",
    "apiPreview": "Vista previa de la API",
    "appPreview": "Vista previa de la aplicación",
    "caseTechnologies": "Tecnologías utilizadas/Competencias",
    "caseCredits": "Créditos",
    "r3playCaseHeading":"Estudio de caso de la aplicación R3play",
    "r3playCaseIntroduction":"R3play es una aplicación web, desarrollada utilizando la pila MERN, que proporciona a los usuarios información sobre películas, series de televisión y anime. Los usuarios pueden acceder a información sobre películas, directores y géneros. Los usuarios pueden crear una cuenta, actualizar su información y crear una lista de sus películas favoritas, series de televisión y anime.",
    "r3playCaseRequired":"R3play fue un proyecto requerido que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio del desarrollo web de pila completa usando JavaScript.",
    "r3playCaseAim": "El objetivo del proyecto era desarrollar una aplicación de pila completa que pudiera añadir a mi cartera profesional. El problema que quería resolver era construir la aplicación web completa de pila completa conectando el lado del servidor previamente diseñado y el lado del cliente para la aplicación desde cero.",
    "r3playCaseAboutServer": "Desarrollé una API RESTful usando Node.js y Express, que interactúa con una base de datos no relacional (MongoDB). La API emplea métodos HTTP comunes como GET, PUT, POST y DELETE. Para recuperar y almacenar datos en la base de datos, se utilizan métodos CRUD. La API proporciona películas, series de televisión e información de anime en formato JSON.",
    "caseViewEndpoints": "Ver puntos finales",
    "r3playCasePostman": "Utilicé Postman para probar respuestas y solicitudes a la API. También hice uso de la autenticación HTTP básica y la autenticación JWT para proporcionar las características de autenticación y autorización.",
    "r3playCaseAboutClient": "Después de completar el proyecto de API, procedí a construir la interfaz front-end que los usuarios necesitarían al interactuar con la lógica y los datos de la API y la base de datos. Es una aplicación web de una sola página, sensible, desarrollada con React y React-Redux. Muestra varias vistas de la interfaz, incluyendo (pero no limitado a) una vista principal (muestra una lista de todas las películas, series de televisión y anime), una sola película, series de televisión y vistas de anime (muestra datos sobre una sola película, serie de televisión y anime, y permite a los usuarios agregarlos o eliminarlos de su lista de favoritos), una vista de inicio de sesión, una vista de registro y una vista de perfil (donde los usuarios pueden actualizar sus datos de usuario y la lista de favoritos).",
    "caseSliderTip": "Utilice los controles para deslizar la lista de proyectos. Pase el cursor sobre los títulos de las diapositivas para leer más.",
    "r3playCaseDurationData": "12 semanas en total (backend: 7 semanas, frontend: 5 semanas)",
    "r3playCaseConclusionData": "La aplicación de películas fue solo la segunda aplicación web completa que desarrollé en el curso de desarrollo web Full-Stack. Cuando se terminó, me enfoqué en mejorar mis habilidades de desarrollo, específicamente el enfoque de desarrollo basado en pruebas. Requiere implementar la fase de prueba antes de agregar la lógica funcional real, permitiendo un desarrollo más seguro, libre de errores y más rápido.",
    
    
    "myFlixCaseHeading":"Estudio de caso de la aplicación MyFlix",
    "myFlixCaseIntroduction":"MyFlix-Angular-App es una aplicación web, desarrollada utilizando la pila MEAN, que proporciona a los usuarios información sobre películas. Los usuarios pueden acceder a información sobre películas, directores y géneros. Los usuarios pueden crear una cuenta, actualizar su información y crear una lista de películas favoritas.",
    "myFlixCaseRequired":"MyFlix-Angular-App fue un proyecto requerido que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio del desarrollo web de pila completa usando JavaScript. Además, practiqué gestión de proyectos ágil, suministro de retroalimentación y habilidades de generación de documentación.",
    "myFlixCaseAboutServer":"Desarrollé una API RESTful usando Node.js y Express que interactúa con una base de datos no relacional (MongoDB). La API emplea métodos HTTP comunes como GET, PUT, POST y DELETE. Para recuperar y almacenar datos en la base de datos, se utilizan métodos CRUD. La API proporciona películas, series de televisión e información de anime en formato JSON.",
    "myFlixCasePostman":"Utilicé Postman para probar respuestas y solicitudes a la API. También hice uso de la autenticación HTTP básica y la autenticación JWT para proporcionar las características de autenticación y autorización.",
    "myFlixCaseAgileData":"El trabajo en el proyecto comenzó con la creación de la junta de Kanban y llenarlo con los requisitos del proyecto y las historias de usuario. Cuando se completó una tarea de proyecto, se trasladó a la sección \"Hecho\". Además, generé documentación detallada con Typedoc según los requisitos del proyecto.",
   
    "myFlixCaseAim":"El objetivo del proyecto era desarrollar una aplicación de pila completa que pudiera añadir a mi cartera profesional. El problema que quería resolver era construir la aplicación web completa de pila completa conectando el lado del servidor previamente diseñado y el lado del cliente para la aplicación desde cero." ,
    "myFlixCaseConclusion":"La aplicación myFlix fue la última aplicación web completa que desarrollé en el curso de desarrollo web Full-Stack. Cuando se terminó, procedí a mejorar mi cartera.",
    "myFlixCaseAboutClient":"Construí la interfaz front-end para que los usuarios pudieran interactuar con la lógica y los datos de la API y la base de datos. Es una aplicación web de una sola página, sensible, desarrollada con interfaz de usuario angular y material. Muestra varias vistas de la interfaz, incluyendo una vista principal (muestra una lista de todas las películas, un botón para administrar favoritos y botones para ver información adicional de la película), una vista de inicio de sesión/registro y una vista de perfil (donde los usuarios pueden actualizar sus datos de usuario)." ,
    "myFlixCaseConclusionData":"La aplicación myFlix fue la última aplicación web completa que desarrollé en el curso de desarrollo web Full-Stack. Cuando se terminó, procedí a mejorar mi cartera.",
    "myFlixCaseConclusionData2":"Las dificultades que encontré ocurrieron al final del proyecto y se relacionaron más con las peculiaridades de Angular y Github. Un problema ocurrió cuando las páginas de Github se negaron a implementar la aplicación durante mucho tiempo. La otra ocurrió cuando los cambios locales en la base de código no se mostraron en la aplicación desplegada. Para solucionar este problema, me puse en contacto con mi mentor y tutor y, durante una sesión de programación de par, nos las arreglamos para solucionar los problemas.",
    "myFlixCaseConclusionData3":"También fue una experiencia útil en depuración y solución de problemas, usando comandos de terminal git, detalles de trabajo con Angular y sesiones de programación de pares. También agregué nuevas habilidades a mi arsenal, como Typescript, Angular, Material UI, comentario de código adecuado, colaboración y otros.",
    "myFlixCaseDurationData":"Casi 1,5 semanas (10 días)",
    "myFlixCaseChallenge":"El desarrollo de la aplicación myFlix tomó mucho menos tiempo y esfuerzo en comparación con la aplicación R3play React desde:",
    "myFlixCaseChallengeDetail1":"La API ya ha sido construida",
    "myFlixCaseChallengeDetail2":"La amplia práctica con React ayudó a progresar más rápido",
    "myFlixCaseChallengeDetail3":"No agregué muchas características adicionales y me atengo a los requisitos básicos del curso",
    "myFlixCaseChallengeDetail4":"El tiempo que quedaba en el programa ya era limitado",    
    "myFlixMainTakeaway1":"Mejorar la funcionalidad de la aplicación para reflejar las características de la aplicación R3play",
    "myFlixMainTakeaway2":"Investiga más sobre Typescript",
    "myFlixMainTakeaway3":"Leer más sobre Material UI",
    "myFlixMainTakeaway4":"Continuar explorando otras tecnologías y mejores prácticas en el desarrollo web",
    

    "meetCaseHeading": "Estudio de caso de Meet App",
    "meetCaseIntroduction": "Meet App es una aplicación Web progresiva receptiva, desarrollada utilizando el enfoque de desarrollo basado en pruebas utilizando las funciones Lambda sin servidor de AWS, la pantalla de autenticación y autorización de Google OAuth2 y la biblioteca Recharts para permitir a los usuarios ver los eventos de la API de Google Calendar. Los usuarios pueden autenticarse con Google, especificar la ciudad y el número de eventos para mostrar los eventos y leer más sobre ellos. La aplicación se puede instalar en escritorio / móvil gracias a las recomendaciones de la PWA, se usa tanto en línea como fuera de línea, y muestra notificaciones cuando se ingresan datos incorrectos y/o se pierde la conexión a Internet.",
    "meetCaseRequired": "Meet App fue un proyecto obligatorio que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio de las habilidades de desarrollo web de pila completa impulsadas por pruebas utilizando JavaScript y tecnologías sin servidor.",
    "meetCaseAboutTDD": "Desarrollé la aplicación escribiendo primero las historias de usuario. Con la ayuda del enfoque de desarrollo basado en pruebas, incorporé la unidad, la integración, la aceptación del usuario y los métodos de prueba de extremo a extremo para escribir las pruebas requeridas antes de implementar el código.",
    "meetCaseAboutServerAndApi": "Desarrollé el lado del servidor utilizando las funciones Lambda sin servidor de AWS como requisito para el proyecto. El uso de serverless permite reducir el trabajo adicional para administrar un servidor y facilita la escalabilidad. Para los datos de eventos de la aplicación, se utilizó el Calendario de Google de CareerFoundry. La pantalla de autenticación de Google OAuth2 se configuró para autenticar y autorizar a los usuarios a la aplicación. En las etapas finales de desarrollo, hice uso del service worker de React para transformar la aplicación en una aplicación Web Progresiva. La librería Recharts permite la visualización de datos de eventos en forma de dos tipos de gráficos (Scatter y Pie).",
    "meetCaseAim": "El proyecto tenía como objetivo desarrollar una aplicación full-stack completamente funcional que pudiera agregar a mi cartera profesional. El problema que quería resolver era crear una aplicación web completa de pila completa empleando el enfoque de desarrollo basado en pruebas utilizando las funciones Lambda sin servidor de AWS, React.js, y los requisitos de la Aplicación Web Progresiva.",
    "meetCaseConclusion": "La aplicación myFlix fue la última aplicación web completa que desarrollé en el curso de desarrollo web Full-Stack. Cuando estuvo terminado, procedí a mejorar mi portafolio.",
    "meetCaseAboutClient":"Para la parte visual, la interfaz se diseñó de manera receptiva con CSS y JSX normales.",
    "meetCaseConclusionData":" La aplicación Meet fue uno de los últimos proyectos en el curso de desarrollo web Full-Stack. Cuando terminó, me concentré en mejorar mis habilidades de desarrollo de React, específicamente sumergiéndome en un nuevo tema: el desarrollo de aplicaciones nativas con React Native y Android Studio.",
    "meetCaseDurationData": "Casi 1 mes (28 días)",
    "meetCaseChallenge1": "El mayor desafío para mí en este proyecto fue el enfoque de desarrollo basado en pruebas en sí mismo. Habiendo escrito código en el estilo impulsado por el comportamiento antes, tuve que dedicar un tiempo a acostumbrarme al nuevo método. Sin embargo, el trabajo en la aplicación fue bastante bien y me acostumbré al nuevo tema rápidamente. Uno de los problemas mientras trabajaba en el proyecto fue la incapacidad de los usuarios para autenticarse en la aplicación. Después de comunicarme con mi tutor, resolví el problema agregando manualmente los usuarios de prueba a través de la consola de desarrolladores de Google.",
    "meetCaseChallenge2": "Después de solucionar problemas de instalación de la aplicación en un teléfono inteligente, la convertí con éxito en una Aplicación Web Progresiva. También disfruté trabajando con las notificaciones de usuario y la biblioteca Recharts. También mejoré mis conocimientos y habilidades del enfoque TDD y configuré las cuentas de desarrollador de AWS y Google, además de confirmar la propiedad del dominio.",    
    "meetMainTakeaway1": "Practique el enfoque TDD en proyectos paralelos",
    "meetMainTakeaway2": "Descubra más sobre la visualización de datos",



    "notFound": "No pudimos encontrar el recurso que estabas buscando.",
    "returnHomeParagraph": "Pero siempre puedes volver a la ",
    "returnHomeLink": "página de inicio",

    "TDDSkill":"Desarrollo impulsado por pruebas",
    "kanbanSkill":"Junta de Kanban",
    "agileSkill":"Flujo de trabajo ágil",
    "userStoriesSkill":"Historias de usuarios",
    "documentationSkill": "Documentación",
    "collabSkill":"Colaboración",
    "feedbackSkill":"Proporcionar retroalimentación",
    "contributeSkill":"Contribuir",
    "testingSkill": "Pruebas",
    "apiSkill": "Google Calendar API",
    "pwsSkill": "Aplicaciones web progresivas",
    "responsiveSkill": "Diseño sensible",
    "deploySkill": "Implementación de un sitio web",
    "caseLead": "Rol: Desarrollador principal",
    "caseTutor": "Tonny Ntambaazi:",
    "caseTutor2": "Director creativo",
    "caseMentor": "Nizar Triki:",
    "caseMentor2": "Administrador de ingeniería de software",
    "r3playMainTakeaway1": "Centrarse en la funcionalidad requerida primero",
    "r3playMainTakeaway2": "Mejorar las habilidades de gestión del tiempo",
    "r3playMainTakeaway3": "Profundizar en el conocimiento de las tecnologías utilizadas leyendo y practicando más",
    "r3playMainTakeaway4": "No dudo en pedir ayuda en caso de problemas técnicos",
    "r3playCaseChallenge1": "El desarrollo del lado del backend fue el más lento, mientras que el trabajo en el lado del cliente fue el más difícil técnicamente. Como resultado, me tomó más tiempo completar la pila completa en comparación con la duración habitual de dos logros de CareerFoundry. La razón de esto fue que me concentré en las mejoras funcionales y visuales de ambos logros por encima de los requisitos básicos, y necesitaba más tiempo para solucionar los problemas de la representación condicional de los elementos JSX, cómo implementar Redux en React, y la lógica condicional detrás de la representación de las sugerencias de películas para el usuario." ,
    "r3playCaseChallenge2": "Sin embargo, este fue mi proyecto favorito. He disfrutado desarrollando la interfaz de usuario y trabajando con la información de la base de datos. También mejoré rápidamente mis habilidades de terminal, comprensión de la consulta de la base de datos MongoDB NoSQL, renderizado condicional, filtrado de datos, personalización de los componentes de React Bootstrap, así como habilidades de administración de tiempo y priorización. Afortunadamente, mi tutor y mentor me ayudó durante el proyecto y pude aplicar las habilidades adquiridas más tarde al implementar características adicionales a la aplicación." ,
    "r3playSlide1Heading": "Vista de inicio de sesión",
    "r3playSlide2Heading": "Vista de película",
    "r3playSlide3Heading": "Vista de perfil",
    "r3playSlide1Description": "La vista de inicio de sesión de la aplicación R3 play donde los usuarios pueden iniciar sesión en la aplicación",
    "r3playSlide2Description": "La vista de películas de la aplicación R3play, que muestra una lista de películas disponibles en la aplicación",
    "r3playSlide3Description": "La vista de perfil de la aplicación R3play donde los usuarios pueden cambiar la información de su cuenta",
    
    "menu": {
        "aboutMenu": "Sobre mí",
        "projectsMenu": "Proyectos",
        "casesMenu": "Casos",
        "testimonialsMenu": "Testimonios",
        "contactMenu": "Contacto",
        "resumeMenu": "Currículum",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
    },
    "footer": {
        "copy": "© Yevhenii Airapetian, 2024 Todos los derechos reservados.",
        "impressumFooter": "Impresión"
    },
    "aboutCvDeAlt": "Un icono que muestra la bandera alemana",
"aboutCvEnAlt": "Un icono que muestra la bandera estadounidense",
"aboutCvUkAlt": "Un icono que muestra la bandera ucraniana",
"aboutCvDeTitle": "Haga clic aquí para descargar mi currículum en alemán. Es posible que deba utilizar un visor de archivos como Adobe Acrobat o similar",
"aboutCvEnTitle": "Haga clic aquí para descargar mi currículum en inglés. Es posible que deba utilizar un visor de archivos como Adobe Acrobat o similar",
"aboutCvUkTitle": "Haga clic aquí para descargar mi currículum en ucraniano. Es posible que deba utilizar un visor de archivos como Adobe Acrobat o similar",
"toggleResumeTitle": "Alternar archivos de reanudación",
"checkoutCodeTitle": "Verificar el código en Github",
"profileImageAlt": "Una imagen que muestra a un hombre con una chaqueta"
}