{
    "app_title": "Yevhenii Airapetian - Portfolio",
    "languages": "Sprachen",
    "introduction":"Ich bin ein Webentwickler mit einer Leidenschaft für Technik",
    "experience":"Ich habe bereits Erfahrungen im Unterrichten von Fremdsprachen und im akademischen Schreiben gesammelt und freue mich auf eine Karriere als Webentwickler.",
    "first focus":"Ich habe mich immer darauf konzentriert, qualitativ hochwertige Arbeit abzuliefern und Fristen einzuhalten, wobei ich meine ausgefeilten Fähigkeiten zur Problemlösung, zum Zeitmanagement und zum logischen Denken eingesetzt habe.",
    "second focus":"Mein Ziel ist es, mein Fachwissen mit meinen beruflichen Ambitionen zu kombinieren, um funktionale, ansprechende und zugängliche Softwarelösungen zu entwickeln.",
    "availability":"Ich stehe für Büro- und Hybridarbeit im Raum Berlin und Potsdam oder aus der Ferne zur Verfügung.",
    "hobbies":"Zusätzlich zu meinen Leidenschaften in der Webentwicklung bin ich auch ein aktiver Hobbyfotograf und Fitnessenthusiast, und an jedem anderen Tag kann man mich draußen beim Fotografieren oder beim Gewichtheben antreffen.",
    "code":"Code",
    "projects":"Projekte",
    "projectsInfo":"Hier finden Sie die aktuellen Webentwicklungsprojekte, die ich abgeschlossen und an denen ich gearbeitet habe. Sie haben alle Hyperlinks zur Codebasis und zu den Projektfällen, die meisten haben einen Link zur bereitgestellten Version, und einige haben auch zusätzliche Links",
    "projectsViewTip":"Verwenden Sie die Schieberegler, um durch die Projektliste zu blättern. Bewegen Sie die Maus über eine bestimmte Folie, um die Projektlinks anzuzeigen.",
    "r3playInfo":"Die Web-API-Schnittstelle von R3play, die es den Nutzern ermöglicht, sich zu registrieren und abzumelden, Informationen über Filme, Fernsehserien und Anime einzusehen und ihre Favoritenliste zu verwalten.",
    "r3playAPIInfo":"Mit Node.js, Express und MongoDB entwickelte Web-API, die es Nutzern ermöglicht, sich anzumelden, abzumelden, Informationen über Filme, Fernsehsendungen und Anime anzusehen und Favoriten zu verwalten.",
    "myFlixInfo":"Ein Front-End-Teil für die R3play-Web-API, das mit Angular, Typescript und Material UI entwickelt wurde und es den Benutzern ermöglicht, sich zu registrieren, Filminformationen anzuzeigen und Favoriten hinzuzufügen.",
    "meetInfo":"Eine mit AWS Lambda-Funktionen geschriebene Progressive Web App, die OAuth2-Autorisierung und -Authentifizierung verwendet und Ereignisse aus der Google Calendar API von CareerFoundry anzeigt.",
    "owriteInfo":"Eine React Native-Anwendung, mit der Benutzer chatten können. Benutzer können einen Benutzernamen festlegen, die Chat-Hintergrundfarbe auswählen und Textnachrichten, Bilder und Audioaufnahmen senden.",
    "pokemonInfo":"Eine reaktionsfähige Pokemon-App, die Pokemon mit Ajax von einer externen Pokedex-API abruft und deren Informationen wie Größe, Gewicht, ID sowie Vorder- und Rückseitenbilder anzeigt",
    "toDoInfo":"Eine jQuery und Bootstrap To-Do-App, die es Benutzern ermöglicht, To-Dos zu verwalten. Benutzer können Aufgaben hinzufügen, löschen und neu anordnen, Aufgabenlisten erstellen und löschen und eine Anleitung zur Verwendung der App anzeigen.",
    "projectsSliderMore":"mehr",
    "menu":{
        "aboutMenu" : "Über",
        "projectsMenu": "Projekte", 
        "casesMenu": "Fälle",
        "testimonialsMenu": "Testimonials",
        "contactMenu": "Kontakt",
        "resumeMenu": "Lebenslauf",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
      "footer":{
         "copy":"© Yevhenii Airapetian, 2024. Alle Rechte vorbehalten.",
         "impressumFooter":"Impressum"

     }
  }