{
    "app_title": "Yevhenii Airapetian - Portfolio",
    "languages": "Languages",
    "welcome text": "Hi, I'm Yevhenii!",
    "resume": "Resume",
    "introduction":"I'm a web developer passionate about technology",
    "experience":"With previous experience in teaching foreign languages and academic writing, I'm excited to pursue a career as a web developer.",
    "first focus":"I have always focused on delivering high-quality work that met deadlines, employing my refined problem-solving, time-management, and logical thinking skills.",
    "second focus":"My focus is to combine my expertise with my professional aspirations to help create functional, responsive, and accessible software solutions.",
    "availability":"I'm available for on-site and hybrid employment in the Berlin and Potsdam area or remotely.",
    "hobbies":"In addition to my passions in web development, I'm also an active hobby photographer and fitness enthusiast, and any other day you can find me outside taking photos or lifting heavy weights.",
    "code":"Code",
    "projects":"Projects",
    "projectsInfo":"Here you will find the current web development projects that I completed and worked on. All of them have hyperlinks to the codebase and the project cases, most have a link to the deployed version, and some also have additional links.",
    "projectsViewTip":"Use the slider controls to click through the projects list. Hover over a specific slide to access the project's links",
    "r3playInfo":"The front end of the R3play Web API that allows users to register and deregister, view information about movies, TV series, and anime, and manage their favorites list.",
    "r3playAPIInfo":"A Web API developed with Node.js, Express, and MongoDB, allowing users to register, deregister, view information about movies, TV series, and anime, and manage favorites.",
    "myFlixInfo":"A front-end part for the R3play Web API designed with Angular, Typescript, and Material UI allowing users to register, view information about movies, and add favorites.",
    "meetInfo":"A Progressive Web App written with AWS Lambda functions that employs OAuth2 authorization and authentication and displays events from CareerFoundry's Google Calendar API.",
    "owriteInfo":"A React Native application that allows users to chat. Users can set a username, choose the chat background color, and send text messages, pictures, and audio recordings.",
    "pokemonInfo":"A responsive Pokemon App fetching Pokemon with Ajax from an external Pokedex API and displaying their info such as Pokemon height, weight, ID, and front and back images",
    "toDoInfo":"A jQuery and Bootstrap to-do app that allows users to manage to-dos. Users can add, delete, and rearrange to-dos, create and delete to-do lists, and see a guide on how to use the app.",
    "projectsSliderMore":"More",
    "menu":{
        "aboutMenu" : "About",
        "projectsMenu": "Projects", 
        "casesMenu": "Cases",
        "testimonialsMenu": "Testimonials",
        "contactMenu": "Contact",
        "resumeMenu": "Resume",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
     "footer":{
        "copy":"© Yevhenii Airapetian, 2024. All rights reserved.",
        "impressumFooter":"Imprint"
    }
  }
  