{
    "app_title": "Yevhenii Airapetian - Portafoglio",
    "languages": "Lingue",
    "welcome text": "Ciao, sono Yevhenii!",
    "resume": "Resume",
    "introduction":"Sono uno sviluppatore web appassionato di tecnologia",
    "experience":"Con precedenti esperienze nell'insegnamento delle lingue straniere e nella scrittura accademica, sono entusiasta di intraprendere una carriera come sviluppatore web.",
    "first focus":"Mi sono sempre concentrato sulla fornitura di un lavoro di alta qualità che rispettasse le scadenze, impiegando le mie raffinate capacità di problem solving, gestione del tempo e pensiero logico.",
    "second focus":"Il mio obiettivo è quello di combinare la mia esperienza con le mie aspirazioni professionali per contribuire a creare soluzioni software funzionali, reattive e accessibili.",
    "availability":"Sono disponibile per l'impiego in loco e ibrido nella zona di Berlino e Potsdam o da remoto.",
    "hobbies":"Oltre alle mie passioni nello sviluppo web, sono anche un fotografo di hobby attivo e appassionato di fitness, e qualsiasi altro giorno puoi trovarmi fuori a scattare foto o sollevare pesi pesanti.",
    "code":"Codice",
    "projects":"Progetti",
    "projectsInfo":"Qui troverai i progetti di sviluppo web attuali che ho completato e su cui ho lavorato. Tutti hanno collegamenti ipertestuali alla base di codice e ai casi di progetto, la maggior parte ha un collegamento alla versione distribuita e alcuni hanno anche collegamenti aggiuntivi.",
    "projectsViewTip":"Usa i controlli del cursore per fare clic sull'elenco dei progetti. Passa il mouse su una diapositiva specifica per accedere ai collegamenti del progetto",
    "r3playInfo":"Il front-end dell'API Web R3play che consente agli utenti di registrarsi e annullare la registrazione, visualizzare informazioni su film, serie TV e anime e gestire l'elenco dei preferiti.",
    "r3playAPIInfo":"Un'API Web sviluppata con Node.js, Express e MongoDB, che consentono agli utenti di registrarsi, annullare la registrazione, visualizzare informazioni su film, serie TV e anime e gestire i preferiti.",
    "myFlixInfo":"Una parte front-end per l'API Web R3play progettata con Angular, Typescript e Material UI che consente agli utenti di registrarsi, visualizzare informazioni sui film e aggiungere preferiti.",
    "meetInfo":"Un'app Web progressiva scritta con funzioni AWS Lambda che utilizza l'autorizzazione e l'autenticazione OAuth2 e visualizza gli eventi dall'API Google Calendar di CareerFoundry.",
    "owriteInfo":"Un'applicazione nativa React che consente agli utenti di chattare. Gli utenti possono impostare un nome utente, scegliere il colore di sfondo della chat e inviare messaggi di testo, immagini e registrazioni audio.",
    "pokemonInfo":"Un'app Pokemon reattiva che recupera Pokemon con Ajax da un'API Pokedex esterna e visualizza le loro informazioni come altezza, peso, ID e immagini anteriori e posteriori dei Pokemon",
    "toDoInfo":"Un jQuery e Bootstrap to-do app che consente agli utenti di gestire to-dos. Gli utenti possono aggiungere, eliminare e riorganizzare le cose da fare, creare ed eliminare elenchi di cose da fare e consultare una guida su come utilizzare l'app.",
    "projectsSliderMore":"Altro",
    "testimonials":"Passaparola",
    "wordOfMouth":"Non sarei dove sono oggi senza tutte le persone meravigliose con cui ho avuto il privilegio di lavorare.",
    "testimonialsViewTip":"Usa i controlli del cursore per fare clic sull'elenco delle testimonianze. Passa il mouse sopra le intestazioni delle testimonianze per saperne di più.",
    "testimonial1":"Maya Septriana, Consulente di carriera, CareerFoundry",
    "testimonial2":"Nizar Triki, Responsabile dello sviluppo software chez Expensya",
    "testimonial3":"Dejan Gogov, Sviluppatore Web, Wild Code School",
    "testimonial1Text":"Yevhenii è qualcuno con cui è così facile collaborare. Cerca sempre l'eccellenza. Ogni volta che gli do un feedback sarebbe disposto ad ascoltare e regolare la presentazione...",
    "testimonial2Text":"Ho avuto l'opportunità di fare da mentore a Yevhenii durante la sua formazione di sviluppo web presso CareerFoundry. Autosufficienza di Yevhenii, rapida comprensione dei concetti...",
    "testimonial3Text":"Durante il nostro bootcamp Fullstack di 6 mesi, Yevhenii ha costantemente mostrato un comportamento positivo e amichevole. Ha affrontato i compiti con determinazione...",
    "testimonialsMore":"Altro",
    "contact":"Contatto",
    "suggestion":"Vuoi lavorare insieme o avere un suggerimento? Sono aperto a opportunità di reclutamento e commenti",
    "eMailMe":"Sentitevi liberi di scrivermi utilizzando il modulo sottostante",
    "contactFormHeader":"Contatto",
    "firstName":"Nome",
    "firstNamePlaceholder":"Joey",
    "lastName":"Cognome",
    "lastNamePlaceholder":"Tribbiani",
    "phoneNumber":"Numero di telefono",
    "phoneNumberPlaceholder":"+49 1234 5678910",
    "eMail":"E-mail",
    "eMailPlaceholder":"example@mail.com",
    "messageOrComment":"Messaggio o commento. Per favore sii gentile!",
    "messageOrCommentPlaceholder":"Il tuo messaggio",
    "contactFormTip":"I campi contrassegnati con l'asterisco sono obbligatori",
    "contactFormPoweredBy":"Alimentato da",
    "caseTDD":"Sviluppo guidato da test",
    "caseServerAndApi":"Lato server e API",
    "caseAgile":"Flusso di lavoro agile",
    "caseOverview":"Panoramica",
    "casePurpose":"Scopo e contesto",
    "caseObjective":"Obiettivo",
    "caseServer":"Lato server",
    "caseClient":"Lato client",
    "caseApproach":"Approccio",
    "caseDuration":"Durata",
    "caseRetrospective":"Retrospettiva",
    "caseChallenges":"Sfide",
    "caseConclusion":" Risultati principali",
    "caseMainTakeaways":"Principali take away per progetti futuri",
    "apiPreview":"Anteprima API",
    "appPreview":"Anteprima app",
    "caseTechnologies":"Tecnologie utilizzate / Competenze",
    "caseCredits":"Crediti",
    "r3playCaseHeading":"Caso di studio dell'app R3play",
    "r3playCaseIntroduction":"R3play è un'applicazione web, sviluppata utilizzando lo stack MERN, che fornisce agli utenti informazioni su film, serie TV e anime. Gli utenti possono accedere alle informazioni su film, registi e generi. Gli utenti possono creare un account, aggiornare le proprie informazioni e creare un elenco di film, serie TV e anime preferiti.",
    "r3playCaseRequired":"R3play era un progetto richiesto che ho sviluppato come parte del mio corso full-stack immersion a CareerFoundry per dimostrare la mia padronanza dello sviluppo web full-stack utilizzando JavaScript.",
    "r3playCaseAim":"Il progetto mirava a sviluppare un'app full-stack completamente funzionante che avrei potuto aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di creare l'applicazione Web full-stack completa collegando il lato server precedentemente progettato e il lato client per l'applicazione da zero.",
    "r3playCaseAboutServer":"Ho sviluppato un'API RESTful usando Node.js ed Express, che interagisce con un database non relazionale (MongoDB). L'API utilizza metodi HTTP comuni come GET, PUT, POST ed DELETE. Per recuperare i dati da e memorizzare i dati nel database, vengono utilizzati metodi CRUD. L'API fornisce informazioni su film, serie TV e anime in formato JSON.",
    "caseViewEndpoints":"Visualizza endpoint",
    "r3playCasePostman":"Ho usato Postman per testare le risposte e le richieste all'API. Ho anche fatto uso di autenticazione HTTP di base e autenticazione JWT per fornire le funzionalità di autenticazione e autorizzazione.",
    "r3playCaseAboutClient":"Dopo aver completato il progetto API, ho proceduto a creare l'interfaccia front-end di cui gli utenti avrebbero bisogno quando interagivano con la logica e i dati dall'API e dal database. Si tratta di una singola pagina, applicazione web reattivo, sviluppato con React e React-Redux. Visualizza diverse viste dell'interfaccia, tra cui (ma non solo) una vista principale (mostra un elenco di tutti i film, serie TV e anime), un singolo film, serie TV e viste anime (mostra i dati su un singolo film, serie TV e anime e consente agli utenti di aggiungerli o eliminarli dalla loro lista di preferiti), una vista di accesso, una vista di registrazione e una vista del profilo (in cui gli utenti possono aggiornare i loro dati utente e l'elenco dei preferiti).",
    "caseSliderTip":"Usa i controlli del cursore per fare clic sull'elenco dei progetti. Passa il mouse sopra le intestazioni delle diapositive per saperne di più.",
    "r3playCaseDurationData":"12 settimane in totale (backend: 7 settimane, frontend: 5 settimane)",
    "r3playCaseConclusionData":"L'app movie è stata solo la seconda applicazione web completa che ho sviluppato nel corso di sviluppo web Full-Stack. Quando è stato finito, mi sono concentrato sul miglioramento delle mie capacità di sviluppo, in particolare l'approccio di sviluppo guidato dai test. Richiede l'implementazione della fase di test prima di aggiungere la logica funzionale effettiva, consentendo uno sviluppo più sicuro, privo di bug e più rapido.",
    
    
    
    "myFlixCaseHeading":"MyFlix App caso di studio",
    "myFlixCaseIntroduction":"MyFlix-Angular-App è un'app web, sviluppata utilizzando lo stack MEAN, che fornisce agli utenti informazioni sui film. Gli utenti possono accedere alle informazioni su film, registi e generi. Gli utenti possono creare un account, aggiornare le proprie informazioni e creare un elenco di film preferiti.",
    "myFlixCaseRequired":"MyFlix-Angular-App era un progetto richiesto che ho sviluppato come parte del mio corso full-stack immersion a CareerFoundry per dimostrare la mia padronanza dello sviluppo web full-stack utilizzando JavaScript. Inoltre, ho praticato la gestione agile del progetto, la fornitura di feedback e le capacità di generazione della documentazione.",
    "myFlixCaseAboutServer":"Ho sviluppato un'API RESTful usando Node.js ed Express che interagisce con un database non relazionale (MongoDB). L'API utilizza metodi HTTP comuni come GET, PUT, POST ed DELETE. Per recuperare i dati da e memorizzare i dati nel database, vengono utilizzati metodi CRUD. L'API fornisce informazioni su film, serie TV e anime in formato JSON.",
    "myFlixCasePostman":"Ho usato Postman per testare le risposte e le richieste all'API. Ho anche fatto uso di autenticazione HTTP di base e autenticazione JWT per fornire le funzionalità di autenticazione e autorizzazione.",
    "myFlixCaseAgileData":"Il lavoro sul progetto è iniziato con la creazione della scheda Kanban e il riempimento con i requisiti del progetto e le storie degli utenti. Quando un'attività di progetto è stata completata, è stata spostata nella sezione \" Fatto\". Inoltre, ho generato una documentazione dettagliata con Typedoc secondo i requisiti del progetto.",
    "myFlixCaseAim": "Il progetto mirava a sviluppare un'app full-stack completamente funzionante che potessi aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di creare l'applicazione Web full-stack completa collegando il lato server precedentemente progettato e il lato client per l'applicazione da zero.",
"myFlixCaseConclusion": "L'app myFlix è stata l'ultima applicazione web completa che ho sviluppato nel corso di sviluppo web Full-Stack. Quando è stato finito, ho proceduto a migliorare il mio portafoglio.",
"myFlixCaseAboutClient": "Ho creato l'interfaccia front-end per consentire agli utenti di interagire con la logica e i dati dall'API e dal database. Si tratta di una singola pagina, applicazione web reattivo, sviluppato con Angular e Material UI. Visualizza diverse viste dell'interfaccia, tra cui una vista principale (mostra un elenco di tutti i film, un pulsante per gestire i preferiti e pulsanti per visualizzare informazioni aggiuntive sul film), una vista di accesso/registrazione e una vista profilo (in cui gli utenti possono aggiornare i propri dati utente).",
"myFlixCaseConclusionData": "L'app myFlix è stata l'ultima applicazione web completa che ho sviluppato nel corso di sviluppo web Full-Stack. Quando è stato finito, ho proceduto a migliorare il mio portafoglio.",
"myFlixCaseConclusionData2": "Le difficoltà che ho incontrato sono accadute alla fine del progetto e legate più alle peculiarità di Angular e Github. Un problema si è verificato quando Github pages ha rifiutato di distribuire l'app per un lungo periodo. L'altro si è verificato quando le modifiche locali alla base di codice non sono state visualizzate nell'app distribuita. Per risolvere questo problema, ho contattato il mio mentore e tutor e, durante una sessione di programmazione in coppia, siamo riusciti a risolvere i problemi.",
"myFlixCaseConclusionData3": "È stata anche un'esperienza utile nel debug e nella risoluzione dei problemi, utilizzando i comandi del terminale git, le specifiche di lavoro con Angular e le sessioni di programmazione delle coppie. Ho anche aggiunto nuove competenze al mio arsenale, come Typescript, Angular, Material UI, commenting del codice corretto, collaboration e altri.",
"myFlixCaseDurationData": "Quasi 1,5 settimane (10 giorni)",
"myFlixCaseChallenge": "Lo sviluppo dell'app myFlix ha richiesto molto meno tempo e sforzi rispetto all'app R3play React poiché:",
"myFlixCaseChallengeDetail1": "L'API è già stata creata",
"myFlixCaseChallengeDetail2":" L'ampia pratica con React ha aiutato a progredire più velocemente",
"myFlixCaseChallengeDetail3": "Non ho aggiunto molte funzionalità aggiuntive e ho rispettato i requisiti del corso di base",
"myFlixCaseChallengeDetail4":" Il tempo rimasto nel programma era già limitato",
"myFlixMainTakeaway1": "Migliora le funzionalità dell'app per riflettere le caratteristiche dell'app R3play",
"myFlixMainTakeaway2": "Ricerca di più su Typescript",
"myFlixMainTakeaway3": "Per saperne di più su Material UI",
"myFlixMainTakeaway4": "Continua ad esplorare altre tecnologie e best practice nello sviluppo web",



"meetCaseHeading":"Meet App caso di studio",
"meetCaseIntroduction": "Meet App è un'applicazione Web progressiva reattiva, sviluppata utilizzando l'approccio di sviluppo test-driven utilizzando le funzioni AWS Serverless Lambda, la schermata di autenticazione e autorizzazione di OAuth2 Google e la libreria Recharts per consentire agli utenti di visualizzare gli eventi API di Google Calendar. Gli utenti possono autenticarsi con Google, specificare la città e il numero di eventi per visualizzare gli eventi, e leggere di più su di loro. L'app può essere installata su desktop / mobile grazie alle raccomandazioni PWA, utilizzata sia online che offline, e mostra notifiche quando vengono inseriti dati errati e/o la connessione Internet viene persa.",
"meetCaseRequired": "Meet App era un progetto richiesto che ho sviluppato come parte del mio corso full-stack immersion presso CareerFoundry per dimostrare la mia padronanza delle competenze di sviluppo web full-stack basate su test utilizzando JavaScript e tecnologie serverless.",
"meetCaseAboutTDD": "Ho sviluppato l'applicazione scrivendo prima le storie degli utenti. Con l'aiuto dell'approccio di sviluppo test-driven, ho incorporato l'unità, l'integrazione, l'accettazione dell'utente e i metodi di test end-to-end per scrivere i test richiesti prima di implementare il codice.",
"meetCaseAboutServerAndApi": "Ho sviluppato il lato server utilizzando le funzioni Lambda serverless AWS come requisito per il progetto. L'uso del serverless consente di ridurre il lavoro extra per la gestione di un server e semplifica la scalabilità. Per i dati degli eventi dell'app, è stato utilizzato Google Calendar di CareerFoundry. La schermata di autenticazione di Google OAuth2 è stata configurata per autenticare e autorizzare gli utenti all'app. Nelle fasi finali dello sviluppo, ho utilizzato il service worker di React per trasformare l'app in un'applicazione Web progressiva. La libreria Recharts consente la visualizzazione dei dati degli eventi sotto forma di due tipi di grafici (Scatter e Pie).",
"meetCaseAim": "Il progetto mirava a sviluppare un'app full-stack completamente funzionante che potessi aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di creare un'applicazione Web completa full-stack utilizzando l'approccio di sviluppo test-driven utilizzando le funzioni AWS serverless Lambda, React.js e i requisiti delle Progressive Web App.",
"meetCaseConclusion": "L'app myFlix è stata l'ultima applicazione web completa che ho sviluppato nel corso di sviluppo web Full-Stack. Quando è stato finito, ho proceduto a migliorare il mio portafoglio.",
"meetCaseAboutClient": "Per la parte visiva, il frontend era responsivamente in stile con CSS e JSX regolari.",
"meetCaseConclusionData": "L'app Meet è stato uno degli ultimi progetti del corso di sviluppo web Full-Stack. Quando è stato finito, mi sono concentrato sul miglioramento delle mie capacità di sviluppo di React, in particolare immergendomi in un nuovo argomento: lo sviluppo di app native con React Native e Android Studio.",
"meetCaseDurationData": "Quasi 1 mese (28 giorni)",
"meetCaseChallenge1": "La sfida più grande per me in questo progetto è stato l'approccio di sviluppo test-driven stesso. Avendo scritto codice nello stile behavior-driven prima, ho dovuto passare un po ' di tempo ad abituarmi al nuovo metodo. Tuttavia, il lavoro sull'app è andato abbastanza bene e mi sono abituato rapidamente al nuovo argomento. Uno dei problemi durante il lavoro sul progetto era l'incapacità degli utenti di autenticarsi all'app. Dopo aver contattato il mio tutor, ho risolto il problema aggiungendo manualmente gli utenti di test tramite la Google Developer Console.",
"meetCaseChallenge2": "Dopo aver risolto il problema dell'installazione dell'app su uno smartphone, l'ho trasformata con successo in una Progressive Web App. Mi è piaciuto anche lavorare con le notifiche degli utenti e la libreria di ricariche. Ho anche migliorato le mie conoscenze e competenze sull'approccio TDD e la configurazione degli account per sviluppatori AWS e Google, oltre a confermare la proprietà del dominio.",
"meetMainTakeaway1": "Pratica l'approccio TDD sui progetti collaterali",
"meetMainTakeaway2": "Scopri di più sulla visualizzazione dei dati",


"notFound": "Non siamo riusciti a trovare la risorsa che stavi cercando.",
"returnHomeParagraph": "Ma puoi sempre tornare al",
"returnHomeLink": "pagina iniziale",




"TDDSkill":"Sviluppo guidato da test",
"kanbanSkill":"Scheda Kanban",
"agileSkill": "Flusso di lavoro agile",
"documentationSkill":"Documentazione",
"userStoriesSkill":"Storie utente",
"collabSkill":"Collaborazione",
"feedbackSkill": "Fornire feedback",
"contributeSkill":"Contribuire",
"testingSkill": "Test",
"apiSkill": "Google Calendar API",
"pwsSkill": "Applicazioni Web progressive",
"responsiveSkill":"Responsive design",
"deploySkill": "Distribuzione di un sito web",
"caseLead": "Ruolo: Sviluppatore principale",
"caseTutor": "Tonny Ntambaazi:",
"caseTutor2":"Direttore creativo",
"caseMentor": "Nizar Triki:",
"caseMentor2":"Software Engineering Manager",
"r3playMainTakeaway1": "Concentrati prima sulla funzionalità richiesta",
"r3playMainTakeaway2": "Migliorare le capacità di gestione del tempo",
"r3playMainTakeaway3": "Approfondire la conoscenza delle tecnologie utilizzate leggendo e praticando di più",
"r3playMainTakeaway4": "Non dubitare di chiedere aiuto in caso di problemi tecnici",
"r3playCaseChallenge1": "Lo sviluppo del lato back-end è stato il più dispendioso in termini di tempo, mentre il lavoro sul lato client è stato il più impegnativo tecnicamente. Di conseguenza, mi ci è voluto più tempo per completare lo stack completo rispetto alla solita durata di due risultati di CareerFoundry. La ragione di ciò era che mi sono concentrato sui miglioramenti funzionali e visivi di entrambi i risultati al di sopra dei requisiti di base e avevo bisogno di più tempo per risolvere il rendering condizionale degli elementi JSX, come implementare Redux in React e la logica condizionale dietro il rendering dei suggerimenti di film per l'utente.",
"r3playCaseChallenge2": "Tuttavia, questo era il mio progetto preferito. Mi è piaciuto sviluppare l'interfaccia utente e lavorare con le informazioni del database. Ho anche migliorato rapidamente le mie capacità di terminale, la comprensione dell'interrogazione del database MongoDB NoSQL, il rendering condizionale, il filtraggio dei dati, la personalizzazione dei componenti di React Bootstrap, nonché le capacità di gestione del tempo e di prioritizzazione. Per fortuna, il mio esperto tutor e mentore mi ha assistito durante il progetto e sono stato in grado di applicare le competenze acquisite in seguito quando implementavo funzionalità aggiuntive all'app.",




"r3playSlide1Heading":"Vista accesso",
"r3playSlide2Heading":"Visualizzazione filmato",
"r3playSlide3Heading":"Vista profilo",
"r3playSlide1Description": "La vista di accesso all'app R3play in cui gli utenti possono accedere all'app",
"r3playSlide2Description": "La visualizzazione filmato dell'app R3play che visualizza un elenco di filmati disponibili nell'app",
"r3playSlide3Description": "La visualizzazione del profilo dell'app R3play in cui gli utenti possono modificare le informazioni del proprio account",  
    
"menu": {
  "aboutMenu":"Informazioni",
  "projectsMenu":"Progetti",
  "casesMenu":"Casi",
  "testimonialsMenu":"Testimonianze",
  "contactMenu":"Contatto",
  "resumeMenu":"Resume",
  "r3playMenu": "R3play App",
  "myFlixMenu": "App MyFlix",
  "meetMenu": "Meet App",
  "owriteMenu": "Scrivi app",
  "pokemonMenu": "Pokemon App",
  "toDoMenu": "To Do App"
  },
  "footer":{
  "copy": "© Yevhenii Airapetian, 2024. Tutti i diritti riservati.",
  "impressumFooter":"Impronta"
  },

  "aboutCvDeAlt": "Un'icona che mostra la bandiera tedesca",
"aboutCvEnAlt": "Un'icona che mostra la bandiera americana",
"aboutCvUkAlt": "Un'icona che mostra la bandiera ucraina",
"aboutCvDeTitle": "Clicca qui per scaricare il mio curriculum in tedesco. Potrebbe essere necessario utilizzare un visualizzatore di file come Adobe Acrobat o simili",
"aboutCvEnTitle": "Clicca qui per scaricare il mio curriculum in inglese. Potrebbe essere necessario utilizzare un visualizzatore di file come Adobe Acrobat o simili",
"aboutCvUkTitle": "Clicca qui per scaricare il mio curriculum in ucraino. Potrebbe essere necessario utilizzare un visualizzatore di file come Adobe Acrobat o simili",
"toggleResumeTitle":"Attiva / disattiva file riprendi",
"checkOutCodeTitle": "Controlla il codice su Github",
"profileImageAlt": "Un'immagine che mostra un uomo in giacca"
  }