{
    "app_title": "Євгеній Айрапетян - Портфоліо",
    "languages": "Мови",
    "welcome text": "Привіт, я Євгеній!",
    "resume": "Резюме",
    "introduction":"Я веб-розробник, захоплений технологіями.",
    "experience":"Маючи попередній досвід викладання іноземних мов та написання академічних текстів, я із задоволенням продовжую кар'єру веб-розробника.",
    "first focus":"Я завжди зосереджувався на виконанні високоякісної роботи з дотриманням дедлайнів, використовуючи свої навички вирішення проблем, тайм-менеджменту та логічного мислення.",
    "second focus":"Я зосереджуюсь на тому, щоб об'єднати мій досвід з моїми професійними прагненнями, щоб допомогти створювати функціональні, адаптивні та доступні програмні рішення.",
    "availability":"Я доступний для офісної та гібридної роботи в Берліні та Потсдамі або віддалено.",
    "hobbies":"Окрім мого захоплення веб-розробкою, я також є активним фотографом-любителем та ентузіастом фітнесу, і в будь-який інший день ви можете зустріти мене на вулиці, коли я фотографую або піднімаю важкі предмети.",
    "code":"Код",
    "projects":"Проекти",
    "projectsInfo": "Тут ви знайдете поточні проекти з веб-розробки, які я завершив і над якими працюю. Всі вони мають гіперпосилання на кодову базу та кейси проектів, більшість з них мають посилання на онлайн версію, а деякі також мають додаткові посилання",
    "projectsViewTip":"Використовуйте стрілки, щоб гортати список проектів. Наведіть курсор на певний слайд, щоб отримати доступ до посилань проекту",
    "r3playInfo":"Інтерфейс Web API R3play дозволяє користувачам реєструватися та виходити з системи, переглядати інформацію про фільми, серіали та аніме, а також керувати списками колекцій.",
    "r3playAPIInfo":"Веб-API, розроблений за допомогою Node.js, Express та MongoDB, що дозволяє користувачам реєструватися, скасовувати реєстрацію, переглядати інформацію про фільми, телешоу та аніме, а також керувати обраним.",
    "myFlixInfo":"Front-end для R3play Web API, розроблена за допомогою Angular, Typescript та Material UI, що дозволяє користувачам реєструватися, переглядати інформацію про фільми та додавати їх до обраного.",
    "meetInfo":"Прогресивний веб-додаток, написаний за допомогою функцій AWS Lambda, який використовує авторизацію та автентифікацію OAuth2 і відображає події з Google Calendar API CareerFoundry.",
    "owriteInfo":"React Native додаток, який дозволяє користувачам спілкуватися в чаті. Користувачі можуть встановити ім'я користувача, вибрати колір фону чату та надсилати текстові повідомлення, зображення та аудіозаписи.",
    "pokemonInfo":"Адаптивний додаток про покемонів, який отримує інформацію про покемонів за допомогою Ajax із зовнішнього API Pokedex та відображає дані про них, такі як зріст, вага, ідентифікатор, а також зображення спереду та ззаду",
    "toDoInfo":"Додаток на jQuery та Bootstrap, який дозволяє користувачам керувати справами. Користувачі можуть додавати, видаляти та змінювати порядок справ, створювати та видаляти списки справ, а також переглядати гід з використання програми.",
    "projectsSliderMore":"Більше",
    "menu":{
        "aboutMenu" : "Про мене",
        "projectsMenu": "Проекти", 
        "casesMenu": "Кейси",
        "testimonialsMenu": "Рекомендації",
        "contactMenu": "Контакт",
        "resumeMenu": "Резюме",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
      "footer":{
         "copy":"© Євгеній Айрапетян, 2024 Всі права захищені.",
         "impressumFooter":"Відбиток"
     }
  
  }