{
    "welcome text": "Привіт, я Євгеній!",
    "resume": "Резюме",
    "introduction":"Я веб-розробник, захоплений технологіями.",
    "experience":"Маючи попередній досвід викладання іноземних мов та написання академічних текстів, я із задоволенням продовжую кар'єру веб-розробника.",
    "first focus":"Я завжди зосереджувався на виконанні високоякісної роботи з дотриманням дедлайнів, використовуючи свої навички вирішення проблем, тайм-менеджменту та логічного мислення.",
    "second focus":"Я зосереджуюсь на тому, щоб об'єднати мій досвід з моїми професійними прагненнями, щоб допомогти створювати функціональні, адаптивні та доступні програмні рішення.",
    "availability":"Я доступний для офісної та гібридної роботи в Берліні та Потсдамі або віддалено.",
    "hobbies":"Окрім мого захоплення веб-розробкою, я також є активним фотографом-любителем та ентузіастом фітнесу, і в будь-який інший день ви можете зустріти мене на вулиці, коли я фотографую або піднімаю важкі предмети.",
    "code":"Код",
    "projects":"Проекти",
    "projectsInfo": "Тут ви знайдете поточні проекти з веб-розробки, які я завершив і над якими працюю. Всі вони мають гіперпосилання на кодову базу та кейси проектів, більшість з них мають посилання на онлайн версію, а деякі також мають додаткові посилання",
    "projectsViewTip":"Використовуйте стрілки, щоб гортати список проектів. Наведіть курсор на певний слайд, щоб отримати доступ до посилань проекту",
    "menu":{
        "aboutMenu" : "Про мене",
        "projectsMenu": "Проекти", 
        "casesMenu": "Кейси",
        "testimonialsMenu": "Рекомендації",
        "contactMenu": "Контакт",
        "resumeMenu": "Резюме",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
      "footer":{
         "copy":"© Євгеній Айрапетян, 2024 Всі права захищені.",
         "impressumFooter":"Відбиток"
     }
  
  }