{
    "app_title": "Євгеній Айрапетян - Портфоліо",
    "languages": "Мови",
    "welcome text": "Привіт, я Євгеній!",
    "resume": "Резюме",
    "introduction":"Я веб-розробник, захоплений технологіями.",
    "experience":"Маючи попередній досвід викладання іноземних мов та написання академічних текстів, я із задоволенням продовжую кар'єру веб-розробника.",
    "first focus":"Я завжди зосереджувався на виконанні високоякісної роботи з дотриманням дедлайнів, використовуючи свої навички вирішення проблем, тайм-менеджменту та логічного мислення.",
    "second focus":"Я зосереджуюсь на тому, щоб об'єднати мій досвід з моїми професійними прагненнями, щоб допомогти створювати функціональні, адаптивні та доступні програмні рішення.",
    "availability":"Я доступний для офісної та гібридної роботи в Берліні та Потсдамі або віддалено.",
    "hobbies":"Окрім мого захоплення веб-розробкою, я також є активним фотографом-любителем та ентузіастом фітнесу, і в будь-який інший день ви можете зустріти мене на вулиці, коли я фотографую або піднімаю важкі предмети.",
    "code":"Код",
    "projects":"Проекти",
    "projectsInfo": "Тут ви знайдете поточні проекти з веб-розробки, які я завершив і над якими працюю. Всі вони мають гіперпосилання на кодову базу та кейси проектів, більшість з них мають посилання на онлайн версію, а деякі також мають додаткові посилання",
    "projectsViewTip":"Використовуйте стрілки, щоб гортати список проектів. Наведіть курсор на певний слайд, щоб отримати доступ до посилань проекту",
    "r3playInfo":"Інтерфейс Web API R3play дозволяє користувачам реєструватися та виходити з системи, переглядати інформацію про фільми, серіали та аніме, а також керувати списками колекцій.",
    "r3playAPIInfo":"Веб-API, розроблений за допомогою Node.js, Express та MongoDB, що дозволяє користувачам реєструватися, скасовувати реєстрацію, переглядати інформацію про фільми, телешоу та аніме, а також керувати обраним.",
    "myFlixInfo":"Front-end для R3play Web API, розроблена за допомогою Angular, Typescript та Material UI, що дозволяє користувачам реєструватися, переглядати інформацію про фільми та додавати їх до обраного.",
    "meetInfo":"Прогресивний веб-додаток, написаний за допомогою функцій AWS Lambda, який використовує авторизацію та автентифікацію OAuth2 і відображає події з Google Calendar API CareerFoundry.",
    "owriteInfo":"React Native додаток, який дозволяє користувачам спілкуватися в чаті. Користувачі можуть встановити ім'я користувача, вибрати колір фону чату та надсилати текстові повідомлення, зображення та аудіозаписи.",
    "pokemonInfo":"Адаптивний додаток про покемонів, який отримує інформацію про покемонів за допомогою Ajax із зовнішнього API Pokedex та відображає дані про них, такі як зріст, вага, ідентифікатор, а також зображення спереду та ззаду",
    "toDoInfo":"Додаток на jQuery та Bootstrap, який дозволяє користувачам керувати справами. Користувачі можуть додавати, видаляти та змінювати порядок справ, створювати та видаляти списки справ, а також переглядати гід з використання програми.",
    "projectsSliderMore":"Більше",
    "testimonials":"З вуст в уста",
    "wordOfMouth":"Я не був би там, де я є сьогодні, без усіх цих чудових людей, з якими я мав честь працювати.",
    "testimonialsViewTip":"Використовуйте елементи керування для перегляду списку відгуків. Наведіть курсор на заголовки відгуків, щоб прочитати більше.",
    "testimonial1":"Maya Septriana, Кар'єрний консультант, CareerFoundry",
    "testimonial2":"Nizar Triki, Менеджер з розробки програмного забезпечення chez Expensya",
    "testimonial3":"Dejan Gogov, Веб-розробник, Wild Code School",
    "testimonial1Text":"Євгеній – це людина, з якою дуже легко співпрацювати. Він завжди прагне до досконалості. Кожного разу, коли я даю йому зворотний зв'язок, він готовий вислухати і скорегувати завдання...",
    "testimonial2Text":"У мене була можливість бути ментором Євгенія протягом усього його навчання веб-розробці в CareerFoundry. Самодостатність Євгенія, швидке сприйняття понять...",
    "testimonial3Text":"Під час нашого 6-місячного Fullstack буткемпу Євгеній незмінно демонстрував позитивну та доброзичливу поведінку. Він рішуче підходив до завдань...",
    "testimonialsMore":"Більше",
    "contact":"Зв'язатися",
    "suggestion":"Хочете працювати разом або маєте пропозицію? Я відкритий до можливостей рекрутингу та коментарів",
    "eMailMe":"Не соромтеся надіслати мені електронного листа, використовуючи форму нижче",
    "contactFormHeader":"Зв'язатися",
    "firstName":"Ім'я",
    "firstNamePlaceholder":"Джої",
    "lastName":"Прізвище",
    "lastNamePlaceholder":"Тріббіані",
    "phoneNumber":"Номер телефону",
    "phoneNumberPlaceholder":"+49 1234 5678910",
    "eMail":"Електронна пошта",
    "eMailPlaceholder":"example@mail.com",
    "messageOrComment":"Повідомлення або коментар. Будь ласка, будьте люб'язні!",
    "messageOrCommentPlaceholder":"Ваше повідомлення",
    "contactFormTip":"Поля, позначені зірочкою, є обов'язковими для заповнення",
    "contactFormPoweredBy":"Працює на базі",

    "caseAgile":"Agile Workflow",
    "caseOverview":"Огляд",
    "casePurpose":"Мета і контекст",
    "caseObjective":"Мета",
    "caseServer":"Серверна частина",
    "caseClient":"Клієнтська частина",
    "caseApproach":"Підхід",
    "caseDuration":"Тривалість",
    "caseRetrospective":"Ретроспектива",
    "caseChallenges":"Виклики",
    "caseConclusion": "Висновки та ключові завдання",
    "caseMainTakeaways": "Основні висновки для майбутніх проектів",
    "caseApiPreview": "Попередній перегляд API",
    "caseAppPreview": "Попередній перегляд додатку",
    "caseTechnologies": "Використані технології / навички",
    "caseCredits": "Учасники",
    "r3playCaseHeading": "Розбір кейсу R3play App",
    "r3playCaseIntroduction": "R3play - це веб-додаток, розроблений за допомогою стека MERN, який надає користувачам інформацію про фільми, телесеріали та аніме. Користувачі можуть отримати доступ до інформації про фільми, режисерів та жанри. Користувачі можуть створити обліковий запис, оновити свою інформацію та створити список улюблених фільмів, серіалів та аніме.",
    "r3playCaseRequired": "R3play - це обов'язковий проект, який я розробив у рамках свого повноцінного курсу занурення в CareerFoundry, щоб продемонструвати свою майстерність повноцінної веб-розробки за допомогою JavaScript.",
    "r3playCaseAim": "Проект мав на меті розробити повністю функціонуючий додаток повного стеку, який я міг би додати до свого професійного портфоліо. Проблема, яку я хотів вирішити, полягала в тому, щоб створити цілісний веб-додаток, поєднавши раніше розроблену серверну сторону із клієнтською з нуля.",
    "r3playCaseAboutServer": "Я розробив API RESTful за допомогою Node.js та Express, який взаємодіє з нереляційною базою даних (MongoDB). API використовує загальні методи HTTP, такі як GET, PUT, POST та DELETE. Для отримання даних та зберігання даних у базі даних використовуються методи CRUD. API надає інформацію про фільми, телесеріали та аніме у форматі JSON.",
    "caseViewEndpoints": "Перегляд кінцевих точок",
    "r3playCasePostman": "Я використовував Postman для тестування відповідей та запитів на API. Я також скористався базовою аутентифікацією HTTP та автентифікацією JWT, щоб забезпечити функції аутентифікації та авторизації.",
    "r3playCaseAboutClient": "Завершивши проект API, я продовжив створення клієнта, який би знадобився користувачам під час взаємодії з логікою та даними з API та бази даних. Це односторінковий, адаптивний веб-додаток, розроблений за допомогою React та React-Redux. Він відображає декілька інтерфейсів, включаючи (але не обмежуючись) головний (показує список усіх фільмів, телесеріалів та аніме), окремий фільм, телесеріал та аніме (показує дані про один фільм, телесеріал та аніме, а також дозволяє користувачам додавати або видаляти їх до або зі свого списку улюблених), сторінка входу, реєстрації та створення профілю (де користувачі можуть оновлювати свої дані користувача та список вибраних).",
    "caseSliderTip": "Використовуйте елементи керування повзунком, щоб гортати список проектів. Наведіть курсор на заголовки слайдів, щоб прочитати більше.",
    "r3playCaseDurationData": "Загалом 12 тижнів (бекенд: 7 тижнів, фронтенд: 5 тижнів)",
    "r3playCaseConclusionData": "Додаток до фільму був лише другим повним веб-додатком, який я розробив на курсі веб-розробки Full-Stack. Коли його було закінчено, я зосередився на підвищенні своїх навичок веб-розробки, зокрема підходу, орієнтованого на тестуванні. Він вимагає впровадження фази тестування перед тим, як додати фактичну функціональну логіку, що дозволяє розробляти швидше і безпечніше, і без помилок.",
   
   
    "myFlixCaseHeading":"MyFlix App Case Study",
    "myFlixCaseIntroduction":"MyFlix-Angular-App is a web app, developed using the MEAN stack, that provides users with information about movies. Users can access information about movies, directors, and genres. Users can create an account, update their information, and create a list of favorite movies.",
    "myFlixCaseRequired":"MyFlix-Angular-App was a required project I developed as part of my full-stack immersion course at CareerFoundry to demonstrate my mastery of full-stack web development using JavaScript. Additionally, I practiced Agile project management, feedback providing, and documentation generation skills.",
    "myFlixCaseAboutServer":"I developed a RESTful API using Node.js and Express that interacts with a non-relational database (MongoDB). The API employs common HTTP methods like GET, PUT, POST, and DELETE. To retrieve data from and store data in the database, CRUD methods are used. The API provides movie, TV series, and anime information in JSON format.",
    "myFlixCasePostman":"I used Postman to test responses and requests to the API. I also made use of basic HTTP authentication and JWT authentication to provide for the authentication and authorization features.",
    "myFlixCaseAgileData":"The work on the project started with creating the Kanban board and filling it with the project requirements and user stories. When a project task was completed, it was moved to the \"Done\" section. As well, I generated detailed documentation with Typedoc as per the project's requirements.",
    "myFlixCaseAim":"The project aimed to develop a fully-functioning full-stack app that I could add to my professional portfolio. The problem I wanted to solve was to build the complete full-stack web application by connecting the previously designed server-side and the client-side for the application from scratch.",
    "myFlixCaseConclusion":"The myFlix app was the last full web application I developed in the Full-Stack web development course. When it was finished, I proceeded to enhance my portfolio.",
    "myFlixCaseAboutClient":"I built the front-end interface for users to be able to interact with the logic and data from the API and the database. It is a single-page, responsive web application, developed with Angular and Material UI. It displays several interface views, including a main view (shows a list of all movies, a button to manage favorites, and buttons to view additional movie information), a login/signup view, and a profile view (where users can update their user data).",
    "myFlixCaseConclusionData":"The myFlix app was the last full web application I developed in the Full-Stack web development course. When it was finished, I proceeded to enhance my portfolio.",
    "myFlixCaseConclusionData2":"The difficulties I encountered happened at the end of the project and related more to the peculiarities of Angular and Github. One issue occurred when Github pages refused to deploy the app for a long time. The other one happened when the local changes to the codebase didn't display in the deployed app. To troubleshoot this, I reached out to my mentor and tutor and, during a pair programming session, we managed to fix the problems.",
    "myFlixCaseConclusionData3":"It was also a useful experience in debugging and troubleshooting, using git terminal commands, specifics of working with Angular, and pair programming sessions. I also added new skills to my arsenal, such as Typescript, Angular, Material UI, proper code commenting, collaboration, and others.",
    "myFlixCaseDurationData":"Almost 1.5 weeks (10 days)",
    "myFlixCaseChallenge":"The development of the myFlix app took much less time and effort as compared to the R3play React app since:",
    "myFlixCaseChallengeDetail1":"The API has already been built",
    "myFlixCaseChallengeDetail2":"The extensive practice with React helped to progress faster",
    "myFlixCaseChallengeDetail3":"I didn't add many additional features and stick to the basic course requirements",
    "myFlixCaseChallengeDetail4":"The time left in the program was already limited",    
    "myFlixMainTakeaway1":"Improve the app's functionality to reflect the R3play app's features",
    "myFlixMainTakeaway2":"Research more about Typescript",
    "myFlixMainTakeaway3":"Read more about Material UI",
    "myFlixMainTakeaway4":"Continue exploring other technologies and best practices in web development",
    
    "kanbanSkill":"Kanban board",
    "agileSkill":"Agile workflow",
    "documentationSkill":"documentationSkill",
    "userStoriesSkill":"User stories",
    "collabSkill":"Collaboration",
    "feedbackSkill":"Providing feedback",
    "contributeSkill":"Contributing",
    "testingSkill": "Розробка з позиції тестування",
    "apiSkill":"Google Calendar API",
    "pwsSkill": "Прогресивні веб-програми",
    "responsiveSkill": "Адаптивний дизайн",
    "deploySkill": "Розміщення веб-сайту онлайн",
    "caseLead": "Роль: провідний розробник",
    "caseTutor": "Tonny Ntambaazi:",
    "caseTutor2": "Творчий директор",
    "caseMentor": "Nizar Triki:",
    "caseMentor2": "Менеджер програмного забезпечення",
    "r3playMainTakeaway1": "Спочатку зосередитись на необхідному функціоналі",
    "r3playMainTakeaway2": "Покращити навички тайм-менеджменту",
    "r3playMainTakeaway3": "Поглибити знання про використовувані технології, читаючи та практикуючи більше",
    "r3playMainTakeaway4": "Не сумніватись звернутися за допомогою у разі технічних питань",
    "r3playCaseChallenge1": "Розвиток бекенда був найбільш трудомістким, тоді як робота на стороні клієнта була найбільш складною технічно. Як результат, мені знадобилося більше часу, щоб завершити розробку повного стеку порівняно зі звичайною тривалістю двох проектів CareerFoundry. Причиною цього було те, що я зосередився на функціональних та візуальних вдосконаленнях обох проектів, що перевищувало основні вимоги. Також мені знадобилось більше часу, щоб вирішити проблеми умовної візуалізації елементів JSX, як реалізувати Redux в React та логіку візуалізації пропозицій фільмів користувачеві.",
    "r3playCaseChallenge2": "Тим не менш, це був мій улюблений проект. Мені сподобалось розробляти інтерфейс користувача та працювати з інформацією в базі даних. Я також швидко покращив свої навички рооти в командному рядку, роботи із запитами у базі даних MongoDB NoSQL, умовної візуалізації, фільтрації даних, налаштування компонентів React Bootstrap, а також навички тайм-менеджменту та встановлення пріоритетів. На щастя, мої кваліфікований викладач та наставник допомагали мені під час проекту, і я зміг застосувати отримані навички пізніше впровадивши інші функції у додаток.",


    "r3playSlide1Heading": "Інтерфейс входу",
    "r3playSlide2Heading": "Інтерфейс фільму",
    "r3playSlide3Heading": "Інтерфейс профілю",
    "r3playSlide1Description": "Інтерфейс входу в R3play App, де користувачі можуть увійти в додаток",
    "r3playSlide2Description": "Інтерфейс фільмів в R3play App, який відображає список фільмів, доступних у додатку",
    "r3playSlide3Description": "Інтерфейс профілю в R3play App, де користувачі можуть змінювати інформацію свого облікового запису",


    "menu":{
        "aboutMenu" : "Про мене",
        "projectsMenu": "Проекти", 
        "casesMenu": "Кейси",
        "testimonialsMenu": "Рекомендації",
        "contactMenu": "Контакт",
        "resumeMenu": "Резюме",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
      "footer":{
         "copy":"© Євгеній Айрапетян, 2024 Всі права захищені.",
         "impressumFooter":"Відбиток"
     }
  
  }