{
  "app_title": "Yevhenii Airapetian - Портфолио",
  "languages": "Јазици",
    "welcome text": "Здраво, јас сум Евгениј!",
    "resume": "ЦВ",
    "introduction":"Јас сум веб развивач со страст кон технологијата",
    "experience":"Веќе имам искуство со предавање странски јазици и академско пишување и со нетрпение очекувам кариера како веб развивач.",
    "first focus":"Секогаш сум се фокусирал на испорака на висококвалитетни работни и исполнувајќи ги роковите, користејќи ги моите полирани вештини за решавање проблеми, менаџмент на времето и размислување.",
    "second focus":"Мојата цел е да ја комбинирам мојата експертиза со моите професионални амбиции да развивам функционални, ангажирачки и достапни софтверски решенија.",
    "availability":"Јас сум на располагање за канцеларија и хибридна работа во областа Берлин и Потсдам или далечинско.",
    "hobbies":"Покрај моите страсти во развојот на веб, јас сум и активен аматерски фотограф и фитнес ентузијаст, и секој ден можете да ме најдете надвор од фотографирање или кревање тегови.",
    "code":"Код",
    "projects":"Проекти",
    "projectsInfo": "Еве ги сегашните веб-развојни проекти на кои сум ги завршил и работел. Сите тие имаат хиперлинк со кодната база и проектните случаи, повеќето од нив имаат линкови до онлајн верзијата, а некои имаат дополнителни линкови",
    "projectsViewTip":"Користете ги контролите на лизгачи за да кликнете преку листата на проекти. Спуштајте преку одреден лизгач за пристап до врските на проектот",
    "r3playInfo":"Веб API на R3play им овозможува на корисниците да се регистрираат и да излегуваат, да гледаат информации за филмови, серии и аниме и да управуваат со наведените листи за колекција.",
    "r3playAPIInfo":"Web API се разви со Node.js, Експрес и MongoDB кој им овозможува на корисниците да влезат, да излезат, да гледаат информации за филмови, тв шоуа и аниме и да управуваат со фаворити.",
    "myFlixInfo":"Преден дел за R3play Web API дизајниран со Angular, Typescript и Material UI кој им овозможува на корисниците да се регистрираат, да гледаат информации за филмовите и да додаваат омилени.",
    "meetInfo":"Прогресивна веб апликација напишана со користење на AWS Lambda Functions која користи OAuth2 овластување и автентикација и прикажува настани од Google Calendar API на CareerFoundry.",
    "owriteInfo":"React Native апликација која им овозможува на корисниците да разговараат. Корисниците можат да постават корисништво, да ја изберат бојата на позадината на чатот и да испраќаат смс пораки, слики и аудио снимки.",
    "pokemonInfo":"Респонзивна апликација Pokemon која го повлекува Pokémon користејќи Ајакс од надворешниот API на Pokedex и ги прикажува нивните информации како висина, тежина, Pokémon ID и слики од предната и задната страна",
    "toDoInfo":"A jQuery и Bootstrap to-do апликација која им овозможува на корисниците да управуваат со заданите. Корисниците можат да додаваат, избришуваат и пренаредуваат задања, да креираат и избришуваат списоци на задања и да видат водич за тоа како да ја користат апликацијата.",
    "projectsSliderMore":"Повеќе",
    "testimonials":"Збор на уста",
    "wordOfMouth":"Не би бил таму каде што сум денес без сите прекрасни луѓе со кои имав привилегија да работам.",
    "testimonialsViewTip":"Користете ги контролите на лизгачи за да кликнете преку листата на сведоштва. Тргнете над насловите на сведоштвото за да прочитате повеќе.",
    "testimonial1":"Maya Septriana, Кариерен консултант, CareerFoundry",
    "testimonial2":"Nizar Triki, Менаџер за софтверско инженерство chez Expensya",
    "testimonial3":"Dejan Gogov, Веб развивач, Wild Code School",
    "testimonial1Text":"Евгениј е некој со кој е толку лесно да соработуваш. Секогаш се стреми кон извонредност. Секогаш кога ќе му дадам повратни информации, тој би сакал да слуша и да го прилагоди поднесувањето...",
    "testimonial2Text":"Имав можност да го менторот Евгениј во текот на неговата обука за развој на веб во CareerFoundry. Самодостојноста на Евгенија, брзото сфаќање на концептите...",
    "testimonial3Text":"За време на нашиот 6-месечен bootcamp, Евгениј постојано покажува позитивен и пријателски настроен...",
    "testimonialsMore":"Повеќе",

    "contact":"Контакт",
    "suggestion":"Сакате да работите заедно или да имате предлог? Јас сум отворен за можности за регрутирање и коментари",
    "eMailMe":"Слободно ме праќајте мејл користејќи го формуларот подолу",
    "contactFormHeader":"Контакт",
    "firstName":"Име",
    "firstNamePlaceholder":"Џои",
    "lastName":"Презиме",
    "lastNamePlaceholder":"Трибијани",
    "phoneNumber":"Телефонски број",
    "phoneNumberPlaceholder":"+49 1234 5678910",
    "eMail":"E-Mail",
    "eMailPlaceholder":"example@mail.com",
    "messageOrComment":"Порака или коментар. Те молам биди фина!",
    "messageOrCommentPlaceholder":"Твојата порака",
    "contactFormTip":"Потребни се полиња означени со ѕидачка",
    "contactFormPoweredBy":"Напојувана од",
    


    "caseOverview": "Преглед",
    "casePurpose": "Цел и контекст",
    "caseObjective": "Објективно",
    "caseServer": "Серверска страна",
    "caseClient": "Клиент-страна",
    "caseApproach": "Пристап",
    "caseDuration": "Времетраење",
    "caseRetrospective": "Ретроспектива",
    "caseChallenges": "Предизвици.",
    "caseConclusion": "Заклучок и преземања на клучеви",
    "caseMainTakeaways": "Главни јадења за идни проекти",
    "caseApiPreview": "API Preview",
    "caseAppPreview": "Преглед на апликација",
    "caseTechnologies": "Употребени технологии/Вештини",
    "caseCredits": "Кредити",

    "r3playCaseHeading": "Студија на случај на R3play App",
    "r3playCaseIntroduction": "R3play е веб-апликација, развиена со користење на стекот MERN, која им обезбедува на корисниците информации за филмови, ТВ серии и аниме. Корисниците можат да пристапат до информации за филмови, режисери и жанрови. Корисниците можат да креираат сметка, да ги ажурираат своите информации и да создадат листа на омилени филмови, ТВ серии и аниме.",
    "r3playCaseRequired": "R3play беше задолжителен проект што го развив како дел од мојот курс за потопување со целосен оџак во CareerFoundry за да го покажам моето мајсторство за развој на веб со целосен оџак користејќи JavaScript.",
    "r3playCaseAim": "Проектот имаше за цел да развие целосно функционална апликација со целосен стек што би можел да ја додадам во моето професионално портфолио. Проблемот што сакав да го решам беше да ја изградам комплетната веб-апликација со целосен оџак со поврзување на претходно дизајнираната серверска страна и клиентската страна за апликацијата од нула.",
    "r3playCaseAboutServer": "Развив RESTful API користејќи Node.js и Express, кој е во интеракција со нерелациона база на податоци (MongoDB). API користи вообичаени HTTP методи како GET, PUT, POST и DELETE. За да се извлечат податоци и да се складираат податоци во базата на податоци, се користат CRUD методи. API обезбедува информации за филмови, ТВ серии и аниме во формат JSON.",
    "caseViewEndpoints": "Погледи на крајот",
    "r3playCasePostman": "Го користев Postman за тестирање на одговорите и барањата до API. Исто така, користев основна HTTP автентикација и JWT автентикација за да ги обезбедам карактеристиките за автентикација и овластување.",
    "r3playCaseAboutClient": "По завршувањето на проектот API, продолжив да го градам предниот интерфејс што ќе им треба на корисниците при интеракција со логиката и податоците од API и базата на податоци. Тоа е веб-апликација на една страница, одговорна, развиена со React и React-Redux. Прикажува неколку прегледи на интерфејсот, вклучувајќи (но не ограничувајќи се на) главен приказ (покажува листа на сите филмови, ТВ серии и аниме), еден филм, ТВ серии и прегледи на аниме (покажува податоци за еден филм, ТВ серија, и аниме, и им овозможува на корисниците да ги додадат или избришат на или од нивната листа на омилени), приказ за најавување, приказ на регистрација и приказ на профил (каде што корисниците можат да ги ажурираат своите кориснички податоци и листа на омилени).",
    "caseSliderTip": "Користете ги контролите на лизгачот за да кликнете низ списокот на проекти. Преместете го покажувачот на глувчето преку насловите на слајдовите за да прочитате повеќе.",
    "r3playCaseDurationData": "вкупно 12 недели (заднина: 7 недели, преден дел: 5 недели)",
    "r3playCaseConclusionData": "Филмската апликација беше само втората целосна веб-апликација што ја развив во курсот за развој на веб со целосен стек. Кога беше завршен, се фокусирав на подобрување на моите развојни вештини, особено на развојниот пристап управуван од тестот. Потребно е спроведување на фазата на тестирање пред да се додаде вистинската функционална логика, овозможувајќи побезбеден, без грешки и побрз развој.",
 
    "testingSkill": "Тестирање",
    "apiSkill": "Google Calendar API",
    "pwsSkill": "Прогресивни веб-апликации",
    "responsiveSkill": "Одговорен дизајн",
    "deploySkill": "Распоредување на веб-страница",
    "caseLead": "Улога: главен програмер",
    "caseTutor": "Тони Нтамбаази:",
    "caseTutor2": "Креативен директор",
    "caseMentor": "Низар Трики:",
    "caseMentor2": "Менаџер за инженерство на софтвер",

   
    
    
   
    "r3playMainTakeaway1": "Прво фокусирајте се на потребната функционалност",
    "r3playMainTakeaway2": "Водобрување на вештините за управување со времето",
    "r3playMainTakeaway3": "Длабоко го продлабочува знаењето за користените технологии со читање и практикување повеќе",
    "r3playMainTakeaway4": "Не се сомневам дека ќе посегнете по помош во случај на технички проблеми",


    "r3playCaseChallenge1": "Развојот на задната страна одземаше најмногу време, додека работата на страната на клиентот беше технички најпредизвикувачки. Како резултат на тоа, ми требаше подолго време да го завршам целиот куп во споредба со вообичаеното времетраење на две достигнувања на CareerFoundry. Причината за ова беше тоа што се концентрирав на функционалните и визуелните подобрувања на двете достигнувања над основните барања и ми требаше повеќе време за да го решам условното прикажување на JSX елементите, како да го имплементирам Redux in React и условната логика зад прикажувањето на филмот предлози до корисникот.",
    "r3playCaseChallenge2": "Сепак, ова беше мојот омилен проект. Уживав во развивањето на корисничкиот интерфејс и работата со информации за базата на податоци. Исто така, брзо ги подобрив моите терминални вештини, разбирање за барање на базата на податоци MongoDB NoSQL, условно рендерирање, филтрирање на податоци, прилагодување на компонентите React Bootstrap, како и вештини за управување со времето и приоритизација. За среќа, мојот вешт учител и ментор ми помагаше за време на проектот и можев да ги применам стекнатите вештини подоцна при имплементирање на дополнителни функции на апликацијата.",



    
    "menu":{
        "aboutMenu" : "За мене",
        "projectsMenu": "Проекти", 
        "casesMenu": "Случаи",
        "testimonialsMenu": "Сведоштва",
        "contactMenu": "Контактирајте",
        "resumeMenu": "ЦВ",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
      "footer":{
         "copy":"© Yevhenii Airapetian, 2024 Сите права се задржани.",
         "impressumFooter":"Отпечаток"
     }
  }