{
    "welcome text": "Здраво, јас сум Евгениј!",
    "resume": "ЦВ",
    "introduction":"Јас сум веб развивач со страст кон технологијата",
    "experience":"Веќе имам искуство со предавање странски јазици и академско пишување и со нетрпение очекувам кариера како веб развивач.",
    "first focus":"Секогаш сум се фокусирал на испорака на висококвалитетни работни и исполнувајќи ги роковите, користејќи ги моите полирани вештини за решавање проблеми, менаџмент на времето и размислување.",
    "second focus":"Мојата цел е да ја комбинирам мојата експертиза со моите професионални амбиции да развивам функционални, ангажирачки и достапни софтверски решенија.",
    "availability":"Јас сум на располагање за канцеларија и хибридна работа во областа Берлин и Потсдам или далечинско.",
    "hobbies":"Покрај моите страсти во развојот на веб, јас сум и активен аматерски фотограф и фитнес ентузијаст, и секој ден можете да ме најдете надвор од фотографирање или кревање тегови.",
    "code":"Код",
    "projects":"Проекти",
    "projectsInfo": "Еве ги сегашните веб-развојни проекти на кои сум ги завршил и работел. Сите тие имаат хиперлинк со кодната база и проектните случаи, повеќето од нив имаат линкови до онлајн верзијата, а некои имаат дополнителни линкови",
    "projectsViewTip":"Користете ги контролите на лизгачи за да кликнете преку листата на проекти. Спуштајте преку одреден лизгач за пристап до врските на проектот",
    "r3playInfo":"Веб API на R3play им овозможува на корисниците да се регистрираат и да излегуваат, да гледаат информации за филмови, серии и аниме и да управуваат со наведените листи за колекција.",
    "r3playAPIInfo":"Web API се разви со Node.js, Експрес и MongoDB кој им овозможува на корисниците да влезат, да излезат, да гледаат информации за филмови, тв шоуа и аниме и да управуваат со фаворити.",
    "myFlixInfo":"Преден дел за R3play Web API дизајниран со Angular, Typescript и Material UI кој им овозможува на корисниците да се регистрираат, да гледаат информации за филмовите и да додаваат омилени.",
    "meetInfo":"Прогресивна веб апликација напишана со користење на AWS Lambda Functions која користи OAuth2 овластување и автентикација и прикажува настани од Google Calendar API на CareerFoundry.",
    "owriteInfo":"React Native апликација која им овозможува на корисниците да разговараат. Корисниците можат да постават корисништво, да ја изберат бојата на позадината на чатот и да испраќаат смс пораки, слики и аудио снимки.",
    "pokemonInfo":"Респонзивна апликација Pokemon која го повлекува Pokémon користејќи Ајакс од надворешниот API на Pokedex и ги прикажува нивните информации како висина, тежина, Pokémon ID и слики од предната и задната страна",
    "toDoInfo":"A jQuery и Bootstrap to-do апликација која им овозможува на корисниците да управуваат со заданите. Корисниците можат да додаваат, избришуваат и пренаредуваат задања, да креираат и избришуваат списоци на задања и да видат водич за тоа како да ја користат апликацијата.",
    "projectsSliderMore":"Повеќе",
    "menu":{
        "aboutMenu" : "За мене",
        "projectsMenu": "Проекти", 
        "casesMenu": "Случаи",
        "testimonialsMenu": "Сведоштва",
        "contactMenu": "Контактирајте",
        "resumeMenu": "ЦВ",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
      "footer":{
         "copy":"© Yevhenii Airapetian, 2024 Сите права се задржани.",
         "impressumFooter":"Отпечаток"
     }
  }