{
  "app_title": "Yevhenii Airapetian - Портфолио",
  "languages": "Јазици",
    "welcome text": "Здраво, јас сум Евгениј!",
    "resume": "ЦВ",
    "introduction":"Јас сум веб развивач со страст кон технологијата",
    "experience":"Веќе имам искуство со предавање странски јазици и академско пишување и со нетрпение очекувам кариера како веб развивач.",
    "first focus":"Секогаш сум се фокусирал на испорака на висококвалитетни работни и исполнувајќи ги роковите, користејќи ги моите полирани вештини за решавање проблеми, менаџмент на времето и размислување.",
    "second focus":"Мојата цел е да ја комбинирам мојата експертиза со моите професионални амбиции да развивам функционални, ангажирачки и достапни софтверски решенија.",
    "availability":"Јас сум на располагање за канцеларија и хибридна работа во областа Берлин и Потсдам или далечинско.",
    "hobbies":"Покрај моите страсти во развојот на веб, јас сум и активен аматерски фотограф и фитнес ентузијаст, и секој ден можете да ме најдете надвор од фотографирање или кревање тегови.",
    "code":"Код",
    "projects":"Проекти",
    "projectsInfo": "Еве ги сегашните веб-развојни проекти на кои сум ги завршил и работел. Сите тие имаат хиперлинк со кодната база и проектните случаи, повеќето од нив имаат линкови до онлајн верзијата, а некои имаат дополнителни линкови",
    "projectsViewTip":"Користете ги контролите на лизгачи за да кликнете преку листата на проекти. Спуштајте преку одреден лизгач за пристап до врските на проектот",
    "r3playInfo":"Веб API на R3play им овозможува на корисниците да се регистрираат и да излегуваат, да гледаат информации за филмови, серии и аниме и да управуваат со наведените листи за колекција.",
    "r3playAPIInfo":"Web API се разви со Node.js, Експрес и MongoDB кој им овозможува на корисниците да влезат, да излезат, да гледаат информации за филмови, тв шоуа и аниме и да управуваат со фаворити.",
    "myFlixInfo":"Преден дел за R3play Web API дизајниран со Angular, Typescript и Material UI кој им овозможува на корисниците да се регистрираат, да гледаат информации за филмовите и да додаваат омилени.",
    "meetInfo":"Прогресивна веб апликација напишана со користење на AWS Lambda Functions која користи OAuth2 овластување и автентикација и прикажува настани од Google Calendar API на CareerFoundry.",
    "owriteInfo":"React Native апликација која им овозможува на корисниците да разговараат. Корисниците можат да постават корисништво, да ја изберат бојата на позадината на чатот и да испраќаат смс пораки, слики и аудио снимки.",
    "pokemonInfo":"Респонзивна апликација Pokemon која го повлекува Pokémon користејќи Ајакс од надворешниот API на Pokedex и ги прикажува нивните информации како висина, тежина, Pokémon ID и слики од предната и задната страна",
    "toDoInfo":"A jQuery и Bootstrap to-do апликација која им овозможува на корисниците да управуваат со заданите. Корисниците можат да додаваат, избришуваат и пренаредуваат задања, да креираат и избришуваат списоци на задања и да видат водич за тоа како да ја користат апликацијата.",
    "projectsSliderMore":"Повеќе",
    "testimonials":"Збор на уста",
    "wordOfMouth":"Не би бил таму каде што сум денес без сите прекрасни луѓе со кои имав привилегија да работам.",
    "testimonialsViewTip":"Користете ги контролите на лизгачи за да кликнете преку листата на сведоштва. Тргнете над насловите на сведоштвото за да прочитате повеќе.",
    "testimonial1":"Maya Septriana, Кариерен консултант, CareerFoundry",
    "testimonial2":"Nizar Triki, Менаџер за софтверско инженерство chez Expensya",
    "testimonial3":"Dejan Gogov, Веб развивач, Wild Code School",
    "testimonial1Text":"Евгениј е некој со кој е толку лесно да соработуваш. Секогаш се стреми кон извонредност. Секогаш кога ќе му дадам повратни информации, тој би сакал да слуша и да го прилагоди поднесувањето...",
    "testimonial2Text":"Имав можност да го менторот Евгениј во текот на неговата обука за развој на веб во CareerFoundry. Самодостојноста на Евгенија, брзото сфаќање на концептите...",
    "testimonial3Text":"За време на нашиот 6-месечен bootcamp, Евгениј постојано покажува позитивен и пријателски настроен...",
    "testimonialsMore":"Повеќе",

    "contact":"Контакт",
    "suggestion":"Сакате да работите заедно или да имате предлог? Јас сум отворен за можности за регрутирање и коментари",
    "eMailMe":"Слободно ме праќајте мејл користејќи го формуларот подолу",
    "contactFormHeader":"Контакт",
    "firstName":"Име",
    "firstNamePlaceholder":"Џои",
    "lastName":"Презиме",
    "lastNamePlaceholder":"Трибијани",
    "phoneNumber":"Телефонски број",
    "phoneNumberPlaceholder":"+49 1234 5678910",
    "eMail":"E-Mail",
    "eMailPlaceholder":"example@mail.com",
    "messageOrComment":"Порака или коментар. Те молам биди фина!",
    "messageOrCommentPlaceholder":"Твојата порака",
    "contactFormTip":"Потребни се полиња означени со ѕидачка",
    "contactFormPoweredBy":"Напојувана од",
    

    "caseAgile":"Agile Workflow",
    "caseOverview": "Преглед",
    "casePurpose": "Цел и контекст",
    "caseObjective": "Објективно",
    "caseServer": "Серверска страна",
    "caseClient": "Клиент-страна",
    "caseApproach": "Пристап",
    "caseDuration": "Времетраење",
    "caseRetrospective": "Ретроспектива",
    "caseChallenges": "Предизвици.",
    "caseConclusion": "Заклучок и преземања на клучеви",
    "caseMainTakeaways": "Главни јадења за идни проекти",
    "caseApiPreview": "API Preview",
    "caseAppPreview": "Преглед на апликација",
    "caseTechnologies": "Употребени технологии/Вештини",
    "caseCredits": "Кредити",
    "r3playCaseHeading": "Студија на случај на R3play App",
    "r3playCaseIntroduction": "R3play е веб-апликација, развиена со користење на стекот MERN, која им обезбедува на корисниците информации за филмови, ТВ серии и аниме. Корисниците можат да пристапат до информации за филмови, режисери и жанрови. Корисниците можат да креираат сметка, да ги ажурираат своите информации и да создадат листа на омилени филмови, ТВ серии и аниме.",
    "r3playCaseRequired": "R3play беше задолжителен проект што го развив како дел од мојот курс за потопување со целосен оџак во CareerFoundry за да го покажам моето мајсторство за развој на веб со целосен оџак користејќи JavaScript.",
    "r3playCaseAim": "Проектот имаше за цел да развие целосно функционална апликација со целосен стек што би можел да ја додадам во моето професионално портфолио. Проблемот што сакав да го решам беше да ја изградам комплетната веб-апликација со целосен оџак со поврзување на претходно дизајнираната серверска страна и клиентската страна за апликацијата од нула.",
    "r3playCaseAboutServer": "Развив RESTful API користејќи Node.js и Express, кој е во интеракција со нерелациона база на податоци (MongoDB). API користи вообичаени HTTP методи како GET, PUT, POST и DELETE. За да се извлечат податоци и да се складираат податоци во базата на податоци, се користат CRUD методи. API обезбедува информации за филмови, ТВ серии и аниме во формат JSON.",
    "caseViewEndpoints": "Погледи на крајот",
    "r3playCasePostman": "Го користев Postman за тестирање на одговорите и барањата до API. Исто така, користев основна HTTP автентикација и JWT автентикација за да ги обезбедам карактеристиките за автентикација и овластување.",
    "r3playCaseAboutClient": "По завршувањето на проектот API, продолжив да го градам предниот интерфејс што ќе им треба на корисниците при интеракција со логиката и податоците од API и базата на податоци. Тоа е веб-апликација на една страница, одговорна, развиена со React и React-Redux. Прикажува неколку прегледи на интерфејсот, вклучувајќи (но не ограничувајќи се на) главен приказ (покажува листа на сите филмови, ТВ серии и аниме), еден филм, ТВ серии и прегледи на аниме (покажува податоци за еден филм, ТВ серија, и аниме, и им овозможува на корисниците да ги додадат или избришат на или од нивната листа на омилени), приказ за најавување, приказ на регистрација и приказ на профил (каде што корисниците можат да ги ажурираат своите кориснички податоци и листа на омилени).",
    "caseSliderTip": "Користете ги контролите на лизгачот за да кликнете низ списокот на проекти. Преместете го покажувачот на глувчето преку насловите на слајдовите за да прочитате повеќе.",
    "r3playCaseDurationData": "вкупно 12 недели (заднина: 7 недели, преден дел: 5 недели)",
    "r3playCaseConclusionData": "Филмската апликација беше само втората целосна веб-апликација што ја развив во курсот за развој на веб со целосен стек. Кога беше завршен, се фокусирав на подобрување на моите развојни вештини, особено на развојниот пристап управуван од тестот. Потребно е спроведување на фазата на тестирање пред да се додаде вистинската функционална логика, овозможувајќи побезбеден, без грешки и побрз развој.",
   
    "myFlixCaseHeading":"MyFlix App Case Study",
    "myFlixCaseIntroduction":"MyFlix-Angular-App is a web app, developed using the MEAN stack, that provides users with information about movies. Users can access information about movies, directors, and genres. Users can create an account, update their information, and create a list of favorite movies.",
    "myFlixCaseRequired":"MyFlix-Angular-App was a required project I developed as part of my full-stack immersion course at CareerFoundry to demonstrate my mastery of full-stack web development using JavaScript. Additionally, I practiced Agile project management, feedback providing, and documentation generation skills.",
    "myFlixCaseAboutServer":"I developed a RESTful API using Node.js and Express that interacts with a non-relational database (MongoDB). The API employs common HTTP methods like GET, PUT, POST, and DELETE. To retrieve data from and store data in the database, CRUD methods are used. The API provides movie, TV series, and anime information in JSON format.",
    "myFlixCasePostman":"I used Postman to test responses and requests to the API. I also made use of basic HTTP authentication and JWT authentication to provide for the authentication and authorization features.",
    "myFlixCaseAgileData":"The work on the project started with creating the Kanban board and filling it with the project requirements and user stories. When a project task was completed, it was moved to the \"Done\" section. As well, I generated detailed documentation with Typedoc as per the project's requirements.",
    "myFlixCaseAim":"The project aimed to develop a fully-functioning full-stack app that I could add to my professional portfolio. The problem I wanted to solve was to build the complete full-stack web application by connecting the previously designed server-side and the client-side for the application from scratch.",
    "myFlixCaseConclusion":"The myFlix app was the last full web application I developed in the Full-Stack web development course. When it was finished, I proceeded to enhance my portfolio.",
    "myFlixCaseAboutClient":"I built the front-end interface for users to be able to interact with the logic and data from the API and the database. It is a single-page, responsive web application, developed with Angular and Material UI. It displays several interface views, including a main view (shows a list of all movies, a button to manage favorites, and buttons to view additional movie information), a login/signup view, and a profile view (where users can update their user data).",
    "myFlixCaseConclusionData":"The myFlix app was the last full web application I developed in the Full-Stack web development course. When it was finished, I proceeded to enhance my portfolio.",
    "myFlixCaseConclusionData2":"The difficulties I encountered happened at the end of the project and related more to the peculiarities of Angular and Github. One issue occurred when Github pages refused to deploy the app for a long time. The other one happened when the local changes to the codebase didn't display in the deployed app. To troubleshoot this, I reached out to my mentor and tutor and, during a pair programming session, we managed to fix the problems.",
    "myFlixCaseConclusionData3":"It was also a useful experience in debugging and troubleshooting, using git terminal commands, specifics of working with Angular, and pair programming sessions. I also added new skills to my arsenal, such as Typescript, Angular, Material UI, proper code commenting, collaboration, and others.",
    "myFlixCaseDurationData":"Almost 1.5 weeks (10 days)",
    "myFlixCaseChallenge":"The development of the myFlix app took much less time and effort as compared to the R3play React app since:",
    "myFlixCaseChallengeDetail1":"The API has already been built",
    "myFlixCaseChallengeDetail2":"The extensive practice with React helped to progress faster",
    "myFlixCaseChallengeDetail3":"I didn't add many additional features and stick to the basic course requirements",
    "myFlixCaseChallengeDetail4":"The time left in the program was already limited",    
    "myFlixMainTakeaway1":"Improve the app's functionality to reflect the R3play app's features",
    "myFlixMainTakeaway2":"Research more about Typescript",
    "myFlixMainTakeaway3":"Read more about Material UI",
    "myFlixMainTakeaway4":"Continue exploring other technologies and best practices in web development",
    
    

    "kanbanSkill":"Kanban board",
    "agileSkill":"Agile workflow",
    "documentationSkill":"documentationSkill",
    "userStoriesSkill":"User stories",
    "collabSkill":"Collaboration",
    "feedbackSkill":"Providing feedback",
    "contributeSkill":"Contributing",
    "testingSkill": "Тестирање",
    "apiSkill": "Google Calendar API",
    "pwsSkill": "Прогресивни веб-апликации",
    "responsiveSkill": "Одговорен дизајн",
    "deploySkill": "Распоредување на веб-страница",
    "caseLead": "Улога: главен програмер",
    "caseTutor": "Тони Нтамбаази:",
    "caseTutor2": "Креативен директор",
    "caseMentor": "Низар Трики:",
    "caseMentor2": "Менаџер за инженерство на софтвер",
    "r3playMainTakeaway1": "Прво фокусирајте се на потребната функционалност",
    "r3playMainTakeaway2": "Водобрување на вештините за управување со времето",
    "r3playMainTakeaway3": "Длабоко го продлабочува знаењето за користените технологии со читање и практикување повеќе",
    "r3playMainTakeaway4": "Не се сомневам дека ќе посегнете по помош во случај на технички проблеми",
    "r3playCaseChallenge1": "Развојот на задната страна одземаше најмногу време, додека работата на страната на клиентот беше технички најпредизвикувачки. Како резултат на тоа, ми требаше подолго време да го завршам целиот куп во споредба со вообичаеното времетраење на две достигнувања на CareerFoundry. Причината за ова беше тоа што се концентрирав на функционалните и визуелните подобрувања на двете достигнувања над основните барања и ми требаше повеќе време за да го решам условното прикажување на JSX елементите, како да го имплементирам Redux in React и условната логика зад прикажувањето на филмот предлози до корисникот.",
    "r3playCaseChallenge2": "Сепак, ова беше мојот омилен проект. Уживав во развивањето на корисничкиот интерфејс и работата со информации за базата на податоци. Исто така, брзо ги подобрив моите терминални вештини, разбирање за барање на базата на податоци MongoDB NoSQL, условно рендерирање, филтрирање на податоци, прилагодување на компонентите React Bootstrap, како и вештини за управување со времето и приоритизација. За среќа, мојот вешт учител и ментор ми помагаше за време на проектот и можев да ги применам стекнатите вештини подоцна при имплементирање на дополнителни функции на апликацијата.",


    "r3playSlide1Heading": "Интерфејс за авторизација",
    "r3playSlide2Heading": "филмски интерфејс",
    "r3playSlide3Heading":"интерфејс на профилот",
    "r3playSlide1Description": "Интерфејсот за овластување во апликацијата R3play каде што корисниците можат да се најават во апликацијата",
    "r3playSlide2Description": "Интерфејс за филм за апликација R3play што прикажува листа на филмови достапни во апликацијата",
    "r3playSlide3Description": "Интерфејс на профилот на апликацијата R3play каде што корисниците можат да ги променат информациите за нивната сметка",
    
    "menu":{
        "aboutMenu" : "За мене",
        "projectsMenu": "Проекти", 
        "casesMenu": "Случаи",
        "testimonialsMenu": "Сведоштва",
        "contactMenu": "Контактирајте",
        "resumeMenu": "ЦВ",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
      "footer":{
         "copy":"© Yevhenii Airapetian, 2024 Сите права се задржани.",
         "impressumFooter":"Отпечаток"
     }
  }