{
    "welcome text": "Здраво, јас сум Евхенија!",
    "resume": "ЦВ",
    "introduction":"Јас сум веб развивач со страст кон технологијата",
    "experience":"Веќе имам искуство со предавање странски јазици и академско пишување и со нетрпение очекувам кариера како веб развивач.",
    "first focus":"Секогаш сум се фокусирал на испорака на висококвалитетни работни и исполнувајќи ги роковите, користејќи ги моите полирани вештини за решавање проблеми, менаџмент на времето и размислување.",
    "second focus":"Мојата цел е да ја комбинирам мојата експертиза со моите професионални амбиции да развивам функционални, ангажирачки и достапни софтверски решенија.",
    "availability":"Јас сум на располагање за канцеларија и хибридна работа во областа Берлин и Потсдам или далечинско.",
    "hobbies":"Покрај моите страсти во развојот на веб, јас сум и активен аматерски фотограф и фитнес ентузијаст, и секој ден можете да ме најдете надвор од фотографирање или кревање тегови.",
    "code":"Код",
    "projects":"Проекти",
    "projectsInfo": "Еве ги сегашните веб-развојни проекти на кои сум ги завршил и работел. Сите тие имаат хиперлинк со кодната база и проектните случаи, повеќето од нив имаат линкови до онлајн верзијата, а некои имаат дополнителни линкови",
    "projectsViewTip":"Користете ги контролите на лизгачи за да кликнете преку листата на проекти. Спуштајте преку одреден лизгач за пристап до врските на проектот",
    "menu":{
        "aboutMenu" : "За мене",
        "projectsMenu": "Проекти", 
        "casesMenu": "Случаи",
        "testimonialsMenu": "Сведоштва",
        "contactMenu": "Контактирајте",
        "resumeMenu": "ЦВ",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App"
      },
      "footer":{
         "copy":"© Yevhenii Airapetian, 2024 Сите права се задржани.",
         "impressumFooter":"Отпечаток"
     }
  }